[
{
		"title": "The Evernote Workout Log",
		"date":"Tue Dec 15 2009 13:32:16 GMT-0700 (Mountain Standard Time)",
		"url":"/the-evernote-workout-log/",
		"content": "A few weeks back I wrote about a little fitness experiment I had started to try and reduce the amount of time I spent training while maximizing results. During the experiment I needed a place to document my workouts so I could review my progress and see if I was meeting my goals, as well as plan future workouts. I had some basic requirements in mind when selecting a logging system:\n\nI need to enter workouts as I complete them – I have a terrible memory. By the time I’ve finished doing a round of squats or a half-marathon, I’ve forgotten my time. Its not the kind of thing that I keep in my head. I need to be able to enter workouts immediately. As in, right after I finish the lift, run, swim, whatever.\nI need to view and measure past performance – Training is one of the only things I systemize. I think I might train so that I have something to systemize. I want to be able to quickly look up what my 5k times are trending. I need to see what my last deadlift max was so I can plan the next one.\nI need it to be something I actually use – Sounds simple, but if I have to go out of my way to use the tool, I won’t use it. Bonus if the tool is something I already use for other stuff.\n\nWith that in mind I started my search. Here are some of the tools I played with:\nPaper and Pen – I think this is how everyone starts. Just bring a little notepad and write it down as you go. This was how I recorded and measured for years, but you try scanning cahier after cahier looking for your most recent 5k time. Recording your workouts is fast…reviewing them isn’t.\nDaily Burn – I tried this site out because they had a decent iPhone interface and I could use it online. The tracker is a little clunky, and having to enter the data into the little boxes gets old fast. It seems like it’s geared for people interested in diet and weight loss, so if that’s you’re thing, maybe its for you.\nSpringPad – Ugh, don’t get me started.\nBeyond The White Board – If only I had my own personal white board at the gym…I haven’t actually tried this one out, but it looked promising. If you’re strictly a Crossfitter, you should check it out. It does a lot of the tracking for you, and if you’re into the nutrition thing, it can help you track that too.\nTraining Peaks – Great site if you’re only interested in endurance sports, but since that makes up only half of my programming, it wasn’t a one-stop shop for me.\nAfter exhausting the methods above, I chose to go the freeform route and use Evernote as my workout log. I already use Evernote for everything else, so there was no reason not to leverage it for my workout log as well. I created a basic system in Evernote that allowed me to quickly add my workouts in anywhere I happened to be, get access to old performance characteristics, and to track my areas of concentration to make sure I wasn’t overdoing any particular sport. Here’s how it works:\nCreate a Notebook for Your Workouts\nThis is easy, just create a notebook in Evernote to store your workouts.\n\nEnter Your Workouts Right After (or Even before) You Conduct Them.\nMake sure you write a review (more on this in another article). This is all freeform so enter any information you need to know. (Note: in the picture I made a mistake…its supposed to be a frightening 50 Power Clean Burpees).\n\nTag Your Workouts.\nTags can be anything from running, cycling, or specific stuff that you want quick access to like “5K”, or “The Bear”. This is especially helpful if you have workouts with bizarre names. You can also have sub-tags. For instance I have a tag called run with the sub-tags 5k, 10k, 13.1, etc. This helps your organize when the number of tags you have starts to get out of hand.\n\nCreate a Workout Reference.\nIf you have a workout that is always the same set of complicated movements, its a good idea to create a reference to that workout by creating a new note, putting the contents of the workout in it, then tagging that note with the workout name. Then you can search for the workout by tag, see the workout reference and each time you’ve repeated it. You probably want to keep these references in a different notebook than your workout log to avoid clutter.\n\nCreate Saved Searches to Access Information Quickly.\nExamples “All running workouts from the last 7 days” or ”All running workouts from last week”.\n\nIf you look at [my public workout log][8] most of it should make sense, though I have developed my own personal shorthand (10x10xOHS@145 means 10 sets, 10 reps Overhead Squat with 145lbs). I’ll post a legend some day.\nThis should be plenty to get you going. With Evernote you can also make your notebook public if you’re sharing information with others. An additional feature of Evernote is it’s open API. This means you can access your notes from script (php, c#, etc) and display it somewhere, organize and manipulate it in various ways, etc. I’m working on extending my personal/shared training log as we speak…but that’s for another article."
},

{
		"title": "200 Miles, 8 Runners, 31 Hours",
		"date":"Mon Oct 18 2010 06:00:55 GMT-0600 (Mountain Daylight Time)",
		"url":"/200-miles-8-runners-31-hours-a-race-log/",
		"content": "Introduction\nI’ve always thought of distance running as an individual sport. You throw on some shoes, pop in some earbuds and put one foot in front of the other for a long time. Sure you may go out in a group from time to time, but if you can have a conversation than you’re not working hard enough. This weekend changed my outlook on distance running, and opened my eyes to how fun running with a team can be.\nMany thanks to Jeremy Freeman for the pictures in this post.\nThe Race\nEarly in 2010 John Davenport, on old friend from High School, put out the APB on Facebook looking for runners to fill out a relay team for The Southern Odyssey 200 Mile Relay Race in October. This concept was new to me, so I jumped at it thinking it would be a nice challenge. This was also as I was making my transition from high volume running to low volume high intensity cross training, and I figured it would be a good way to validate my new methods.\nThe plan was simple. Pile 12 runners into 2 vans and take turns running individual legs of the race until you’re done. The legs were preset by the officials and ranged from 2.8 to 9.8 miles in length. It began in Athens, meandered through Dahlonega, Cornelia, Cleveland and much of Northeast Georgia, and finished in Alpharetta. Within a few weeks we had our team and things went quiet while we all prepped in our own way for the road ahead.\nSeptember Shock\n2010 rolled along a little faster than I expected and suddenly September was upon me. We ramped up communications about the upcoming race, planning vans, splitting equipment responsibilities, and otherwise taking care of the last minute preparations for the race.\nThen we had some setbacks.\nThe race was meant to be run by 12, and suddenly we were down to 8 for various reasons. I don’t recall if we ever had a full list of 12, or if we just expected to get that many, but with only a few weeks left to race day we were a group 2/3 deep, with little hope of picking up a full team. The challenging part was that the race began on a Friday, and most folks would have a hard time taking off from work with that little notice. We had a few irons in the fire going into race week, but our core team of 8 was set:\n\nThe Coffey Family (Drew, his wife Andi, and his two sisters Amanda and Alice)\nJohn Davenport\nJeremy Freeman\nJonathon McKay\nLittle old me\n\nEverything was ready to g0.\nRace Week\n\nIt happened. I got sick. For the first time in a while I picked up some kind of upper respiratory/sinus bug and spent most of the week before race trying desperately to get rid of it. The thought of dropping out for my health crossed my mind, but I wasn’t about to leave the team short another member, and I was really looking forward to the run, so I told myself I’d suffer through it and deal with the consequences later.\nNot sure if it was the head cold talking, but it was about this time that I volunteered for the longest legs of the race.\nThursday we met to pile into a few vans and convene in Athens. I learned that two of my other team mates were feeling ill as well. I bought us a box of kleenex to cry or blow our noses into, which ever felt better. Our contingency plan for extra runners fell through, so we were truly down to 8 runners. I think we all expected that to be the case so we nodded, used our kleenex, and stuck with plan A. We made the last of our preparations, settled on race legs, and got a good night’s sleep.\nAnd…Go!\n\nIt was still chilly as we made our way to the start line at 8:30 on Friday morning. The race started in waves, and we were set to begin with 6 other groups at 9:00. We milled around, warmed our hands, and waited anxiously to get going. Some of the other teams were sporting custom shirts. Twisted Blister had a fine logo, and the Chuck Norris team was sporting some hilarious Norrisisms on their van (Chuck Norris never sleeps, he waits…get it, its an overnight race). We decided as a team that next year we were doing something with puff paint on T-shirts, 80’s style. Maybe I’ll volunteer to run a leg dressed as Tom Cruise from Risky Business.\nAndi kicked us off with the first leg of the race, a 4.4 mile sprint through Athens ending at a church parking lot.\nShe projected it would take 45 minutes. She got there in 41.\nThis set the pace for the rest of the race, as we continually came in faster than we expected on our individual legs. As we toiled into night time, our mantra would become “Take it slow, steady”. Easier said than done.\nJeremy took leg 2, another roughly 4 miler while we drove ahead. I was next.\nLeg 3 – 4.0 Miles\nI crammed my feet into my new Vibram Bikila’s, grabbed a water bottle and jogged around a bit to warm up for my run. I would come to find the waiting to be worse than the running as the race continued, but I bided my time, stretched and stretched some more. Jeremy popped up around the bend and made his was up the final hill toward another church parking lot. He crossed the line posting another better than expected time and I was off.\nFailing to remember that this was only the first and shortest of the 4 legs I had to run, I paced myself as if I were running a 10K. The temperature was perfect, the scenery rural, and I was feeling good so I legged it out. Within a minute or so my sinuses felt clear, my lungs opened up, and though I could still tell I was sick, I was feeling much better moving than sitting still. I think remember hearing somewhere that Shaolin monks train harder if they feel themselves getting sick, to remind their bodies that there is much work to do. True or not, I kept that thought in my mind.\nI don’t recall my time, but I think it was somewhere around 33 minutes, a perfectly respectable time for the first of four legs. I passed the bracelet (its better than a baton, trust me), to Drew and he took off on the longest leg so far, 6.5 miles. I grabbed a banana, a bunch of sunflower seed and dried fruit, and settled in for…\nA Long Rest\n\nDrew legged out the 6.5 miles quickly, something I’m sure the second van of team members were both thankful and rueful for. Waiting is the worst, until you have to run.\nWe passed off to the second van as the race legs began to get longer. Jonathon took leg 5 for 5.0 miles, John was on leg 6 for 5.9, Amanda took the first whopper, leg 7 for 9.4 miles, and Alice rounded out leg 8 at 7.5 miles. Everyone beat their own expectations, far exceeding the pace we expected for our team of 9:45. We were building a good buffer for when the going got tough.\nJeremy, a photographer for CNN, pulled double-duty and rode with the second van to take as many photos as he could. My hat is off to him; foregoing his rest time, and being one of the ill team members, he certainly earned some kind of MVP award.\nAndi, Drew and I went on ahead to Ma Ma Dots Country Store, where I bought some muscadines and laid out a blanket to sleep on.\nWe discovered the next difficulty in an overnight relay: you can’t always sleep when you want. In what would be our longest rest of the day we mostly sat around, milled about the country store, read a little, but barely slept. It wasn’t long until Alice was racing up the hill to hand off to Andi for leg 9, a 4.3 miler, and we were off again.\n\nAt the next church parking lot there was a hilarious dachshund. When it spotted someone that hadn’t petted it yet it would run up and roll over waiting for a belly rub. I swear it must have made sure it met every human who entered that parking lot. Its the little things that make a trip like this fun.\nAndi passed off to Jeremy for his grueling and almost entirely uphill 5.9 mile leg. After petting the dog and letting Andi get cleaned up, it was onwards to my next run, the long anticipated:\nLeg 11 – 9.1 Miles\nThis one started in downtown Cornelia GA, quickly exiting into the rural countryside. The race official in the city was also a local resident, and she let us know that most of this land used to be used for growing apples. Neat.\nAbout 4 miles in I was in the zone. Runner’s high. My legs felt great, it was hot but bearable, and I wasn’t worried about finishing. I even passed another runner. As I took the turn back on the the major highway leading to the end of the leg, things took a turn for the worst.\nFeeding off the momentum from the rest of the team, and probably a little overconfident from my first run, I kicked this one off at pace I simply couldn’t sustain. It dawned on me that I hadn’t run anything longer than a 10K in several months. Later a team mate would ask what my longest run recently had been. 9 miles I would reply…earlier today…\nCresting what I thought was the last hill, the runner I passed earlier reminded me that the last few miles are all incline. Really? I don’t remember seeing that on the race map…Sure enough, just as I peeked over the top of this mini-hill I saw in front of me a joint-jarring downhill followed by a hill that looked more like a cliff.\nAw, man.\nI started up and immediately had to ratchet my pace down. I’m not sure what the grade was, but it was enough to force me from a stride to a scurry. I was taking steps about a hand in length; it felt more like running upstairs. Except, you know, for a mile. I began to cramp about half way up and my legs did not recover for the rest of the run.\nAfter the hill you turned off onto a gravel road. Nemesis number two. Wearing Five Fingers are great until you’re running on 2 inch jagged rocks, then they’re a liability. Somewhere in here I stepped down on a piece of gravel that would sprain or break something in my foot, I haven’t figured out which.\nI hobbled into the rest stop, not a church from what I remember, there were goats penned up for some reason. Drew was ready to go, sporting a running vest and a headlamp; I had run the sun down. I ate some dates, a banana, and whatever else I could get my hands. I tried to walk around but I was cramping in places that I’d never cramped before so I just sat down until the pain subsided. Drew pressed on with his 8.5 mile jaunt, we drove ahead to pass him some water. There were some folks out on their porch enjoying the fine evening and they happily let me stretch out on their lawn. I may have fallen asleep somewhere in here, I’m not sure.\nA Short Rest\n\nWe met Drew at the next stop where there was space setup for people to sleep if they wanted. I milled around with the relay team as long as I could before grabbing my blanket and pillow and hitting the hay. At this point I was pretty unsure of myself. I felt sicker, I was cramping, and my head was killing me. I could tell this was worrying the other folks on the team as well, so I figured I better try and get some R&amp;R; I had a few tough runs ahead before all was through.\nI didn’t get much sleep, maybe 10 minutes before it was time to move on. We stopped at a grocery store on the way to the next pit stop and I rested some more in the van while my team mates fueled up. I took inventory of my food intake so far:\n\nPumpkin seeds\nRaisins\nBananas\nApples\nDates\nAlmonds\nPork Rinds\nBeef Jerky\n\nI was craving a meal on a plate. Bacon and eggs. A big pork chop. My wife Cary and brother James were volunteering at leg 18 in the late hours of the night, so the best I could manage was to call in another banana and a long sleeve jersey to combat the cold. Cary suggested dark chocolate Hershey Kisses, which turned out to be a killer idea. I slept for a few more minutes when we arrived at our next check point. It was beginning to get cold out, so I bundled up and tried to sleep, but to no avail. I finally got out of the car and ambled around. That’s when I looked up.\n\nI don’t often get out of metropolitan areas, and when I do I rarely think to look at the night sky. I’m not sure why. When I’m at home I’m constantly looking up at night trying to find constellations and stars through the din of light cast by nearby cities. Out here in the middle of nowhere, where there were no streetlights or cities to drown them out, you can see hundreds of stars. The milky way is visible. Picking out constellations is child’s play. I spent about 20 minutes with my iPhone Sky Chart just finding stars, locating constellations I’d never seen before, and staring at the milky way. I was starting to feel better.\nOur teammates arrived and it was off to the races again, with some extra groaning as we stretched our stiff limbs and tried to make the best of another run on little to no sleep.\nWhen the rest of the team had finished their treacherous run through the back woods of Lumpkin county, Alice handed off to Andi and we were on to our next batch. We met my Cary and James at the next pit stop, I devoured a few dark chocolate Kisses, and we sent Jeremy on his way for leg 18, a 5K. We moved ahead quickly assuming a half hour or so for him to finish. He waltzed in looking like a champ at 26 minutes. I donned the flashing vest and headlamp and I moved on out for…\nLeg 19 – 4.5 Miles\n\nI’m not sure what it was that rejuvenated me. The wide open sky? A hug from my wife? The Hershey Kisses? Whatever it was I set out on this leg refreshed. The course started out of the North Georgia College and State University Campus, down a major road, and then off onto a side road that has never seen a yellow line. I put some space between me a few runners, then turned my headlamp off for a while to get distracted by the night sky. There wasn’t a cloud in sight and anytime the trees cleared I got a fantastic view of the heavens, perhaps just as my ancestors would have seen them. I have to admit, running close to barefoot in the pitch black night, hearing nothing but crickets and howling canines made me feel a bit primal. I should’ve howled.\nOf course, turning my headlamp on again and peering into the thickets to see dozens of eyes reflecting back at me made me feel more like a primal wuss. So much for that howl.\nI crested a short hill and made my way to yet another church parking lot. Convinced that dark chocolate Hershey Kisses were magic cramp erasers, I popped a few more, stretched out, and we moved on to meet Drew at the end of his 4.2 mile night run. I hope he enjoyed his as much as I enjoyed mine.\nA Short Nap\n\nAfter Drew handed off to our compatriots in Van 2, we rode on ahead and made camp in the car at Amicolola Falls, the site of our next major handoff. We intentionally rushed this ride to the next spot since we were all tired and finally felt that we could get some sleep. I’m not sure that all of us made it there without passing out.\nAfter an hour or so of shuteye Van 2 arrived, but not quite for the handoff. Alice was a lucky girl (at least in my mind) and got to run to the top of Amicolola Falls and back for her entire 3 mile leg. We had to go in specific order from start to finish for our time to count, otherwise I would have volunteered for this one. I can’t imagine many people have had the privilege of running this at night, surrounded by the white noise of the falls. I would’ve loved it.\nBleary eyed we shook the cramps out with the sleep and waited at the foot of the falls for the bracelet. After the short nap nobody was interested in running, but it had to be done, and we were closing in on the finish.\nAndi set out on leg 27 for 3 miles, staying tough on her final night run. Jeremy took over on leg 26 up and down a long gravel path to one of the now ubiquitous church parking lots. We drove ahead and I did all I could to prep for the longest leg of the race…\nLeg 27 – 9.8 Miles\nReally? Nearly 10 miles at the end? I would have thought a more appropriate place to put this one was in the beginning somewhere. Alas, suffering is what I volunteered for, so suffer I would.\nResolved to finish with dignity I took the bracelet and moved out. The gravel path picked back up again causing the pain in my foot to really ramp up. The path was surrounded by trees providing no inspirational view of the sky, and a night fog had moved in obstructing much of the view in my lamp. My head was just as foggy so I put one foot in front of the other for a while until I reached the road.\nI was treated to a downhill. This of course is not treat on a long run. Downhills pound your joints to powder, make your liver feel like its coming unglued, and make your quads feel like every step is dropping off a ledge. And as any runner or cyclist knows, what goes down, must come up. Not wishing to disobey any of the laws of running, the road did indeed come up, and I was forced to scurry again up and around a bend to the top. No cramping (thank you Dark Chocolate), but fatigue had set in and I was moving slow.\nThen I came to my last hurrah. 3 Miles of sawtooth road to the finish. I was dead tired and my joints and feet were killing me. I was moving slower and slower by the minute, and the last hill became a run/walk mix. Coming around the last bend I could see Drew waiting to take the bracelet so I managed to hobble out the last several hundred yards with no cramping. Drew took off and we jumped in the van to meet him and the rest of the team at the next stop; I may be done, but there were still many miles left in this race.\nTo the End\n\nOn the way to the next rest we stopped at a convenience store so we could pass some water off to Drew. He didn’t take much with him and it was a 5.6 mile leg so met him halfway for a refill. I took the time to stretch really well, change into some jeans and a t-shirt, and most importantly, suck down some food. I was feeling pretty good, being done with my contribution to the race, and collapsed in the back seat while Andi drove us to the next van meet up. I zoned out in the back seat and when I snapped to I was surprised to find myself back in Alpharetta again. We pulled into the stop and everyone tried to crash for a little while.\nThis is unfortunately where my tale ends. I had a previous obligation in the form of my wife’s company party to attend, and I didn’t plan very well in order to make sure I could attend it and the end of the race. Around 1:00 pm on Saturday I called my wife to come pick me up so I could shower, shave, and head off to an afternoon party with her co-workers. It seems anti-climactic, but it was a fun party and I contributed to it so I wanted to make sure I saw that through as well.\nMy team went on without me, racing through the last 4 legs to the finish line in 31 hours and 2 minutes. That’s a pace 9:21, 24 seconds faster than our projected per mile pace of 9:45.\nConclusions\nI learned a lot on this adventure. I learned that I do like playing with a team, and that when 8 people get together around a common goal a lot can be accomplished. Could I have finished 200 miles alone? Maybe, if I had 3 days and did a lot of walking, but I’d be broken at the end and I wouldn’t have gained as much as I did running with my relay team. I had a great time and I made some new friends. Today, a week later and hopefully well rested, we’re getting together as a team to celebrate, and already making plans for next year’s race. First goal: find four more runners!\nI validated a big portion of my training methodology. I don’t run long distance weekly, or even monthly. I just don’t have the time for it. My adherence to low-volume high-intensity training served me well in this capacity. I will continue to sprint faster in order to endure longer, because that’s what works for me.\nI ran the entire run in Vibram Bikila’s, and while my feet were sore at the end, I walked away feeling like I could run a marathon in these puppies without a second thought. I have some form and gait mistakes to correct, but overall feel pretty good a week after the race. A little sore in the joints and only 1 very small blister? I’ll take that over runner’s knee and shoe blisters any day.\nI like what I eat. Nuts, seeds, bananas, pork rinds, jerky, dark chocolate. I popped the occasional gooey electrolyte snack from time to time, but stuck to real food as much as possible and avoided wheat entirely. My stomach felt satisfied and other than a little cramping during 1 leg, my muscles felt well-fed. Changes for next time? Bring some coconut oil (which I’ve been eating by the spoonful lately), and find a way to replace electrolytes on the sunnier runs. Sweet potatoes maybe? Gatorade makes my stomach hurt but perhaps I can imbibe it before or afterwards. We’ll see.\nThat’s all folks, I’ll see you out there."
},

{
		"title": "The RPM Challenge and The Power of Constrained Creativity",
		"date":"Thu Mar 10 2011 04:30:14 GMT-0700 (Mountain Standard Time)",
		"url":"/the-rpm-challenge-and-the-power-of-constrained-creativity/",
		"content": "It seems like there is a time-boxed challenge for everything out there on the internet. For writers there is NaNoWriMo, for moustache growers there is Movember. Game programmers have Dream.Build.Play. If you do it, there is a challenge for it, and if there isn’t, you can create one. I’ve always wanted to get involved with one of these little challenges, but find myself unwilling (or unable) to commit the time. It’s either work, running, or remodeling a kitchen that gets in the way. When Tim Alexander asked me to play drums for a few tracks on the RPM Challenge this February, I jumped at the chance.\nAfter that I asked him what the RPM challenge was, and what kind of music he was writing.\nThe RPM Challenge\nThe RPM Challenge gives the recording artist a month (in this case the shortest month) to record an entire album start to finish. 10 Songs or 30 minutes. Go. No recording before February 1, recordings must be submitted February 28. Or 29 in a leap year I guess.\n\nTim described his music to me as “Big, dumb pop songs”, but that doesn’t really do them justice. Sure, they’re pop, but in the hilarious way that They Might Be Giants are considered pop. The songs are catchy and original, and the subject matter is usually off the wall. This is Tim’s second year with the RPM Challenge, he successfully recorded Backstage Stories in 2010.\nThe music sounded like a lot of fun, but I had a secret motive for wanting to get involved. Besides the desire to get into one of these creative challenges for the first time, I hadn’t played my drums in damn near a year. I had let my brand new Peavey Radial Pro 1000’s languish due to life’s little setbacks for months. This was the motivation I needed to get my new kit record-ready and my butt back behind the set. I slapped some new heads on the kit, rearranged things a bit, and by the end of January I was miced up and ready to go.\nThe challenge was a breeze, but of course, I was only committed to playing a few songs. Tim would put the files I needed in a shared Dropbox folder, I would load them up in my DAW of choice, bang out a couple of takes, then send the wavs back to Tim for inclusion in his mixes. Toward the end we had worked out a system that involved me providing a stereo reference mix plus all the unmixed tracks that Tim could use to really dial in the sound he was looking for. It went great, and I got the chance to live a creative challenge vicariously through Tim. Not to mention play my new drums. You can hear the results on the Letter Seventeen Bandcamp site.\nEmbrace Creative Constraints\nI see a lot of potential in these time-boxed challenges. First, they absolutely require focus. I know in my daily routine I bounce back and forth between working, coding, writing, training, reading, and in general not focusing on any one thing day in and day out. For people like me, these challenges are the creative constraint we need to force us to focus on one thing for a short period of time, whether it be a day, a week or a month, and let the other stuff wait for a while. This allows the unfocused among us to continue “unfocusing” most of the time, then really apply our energies at intervals in a concentrated effort to finish just one thing. To borrow an analogy, “Reading is the inhale, writing is the exhale”. The same can be said of listening and writing music. If I consider all of my unfocused time as inhaling, gathering information, listening and really forming ideas, I can focus all the data I’ve gathered into one concentrated exhale. Then maybe breathe normally for a while. It’s a bit like Agile software development, you set yourself up to sprint for a very short period of time, concentrate on that and that alone, and come out the other end with something complete.\nThese challenges also force you to organize your brainstorms into something finished. Sure, with some of the challenges like NaNoWriMo there is a premium on getting as many words on the page as possible, but at the end of the day those words have to mean something for them to be worthwhile to you. You could go all month, typing a dictionary into your word processor, or stringing together 500 disparate riffs into 10 songs and calling it a finished piece, but you wouldn’t really be doing yourself justice. The point is to have a finished work that you can show off at the end. You’ll be proud for having finished, but you’ll be prouder for having finished something worthwhile.\nLastly, there is an emphasis on “shipping” with these challenges. I’m reminded of a quote attributed to Steve Job’s, “Real artists ship”, and these challenges have a built-in way of separating the “real artists” from the twiddlers: a deadline. Much has been said about artificial deadlines, but the presence of a community around you, working toward the same goal, in many ways competing with one another to be “real artists” creates some kind of unique motivational magic. From Tim’s RPM page:\n\nI wrote 5 songs in 25 years. Thanks to RPM 2010, I wrote 13 more in 15 days and used 11 of them for my album. My wife had heard me sing maybe 3 times in 17 years. Then I released an album. So I basically went from zero to 60 in a month.\n\nYou can check out the fruits of Tim’s labors, Snowbound, at the Letter Seventeen Bancamp site."
},

{
		"title": "Programming, Languages, and Hacking the Way We Think",
		"date":"Fri Aug 19 2011 06:00:25 GMT-0600 (Mountain Daylight Time)",
		"url":"/hacking-the-way-we-think/",
		"content": "Programming, Languages, and Hacking the Way We Think\nLast night I read a wonderful article about programming languages. It opened with a quote:\n\nA language that doesn’t affect the way you think about programming is not worth knowing.\n-Alan Perlis\n\nAfter a few minutes of thinking about it, I changed the quote to read:\n\nA language that doesn't change the way you think is not worth knowing.\n\nI don't think in Ruby. Or Perl. Or Python. I certainly don't think in any of the C derivatives. I think in English. Even when I program I put a series of nouns, verbs and adjectives together to form sentences that the computer will be able to interpret and compile into byte code.\nWhat does it mean to be an English thinker? What effect does the language and its syntax have on me? Does English have more strong verbs than Eastern languages? Does that have some effect on my thought processes compared to say, a native Japanese speaker? What about other languages, programming or otherwise? If I learned Italian well enough to think in it, would it fundamentally change the way I think?\nWhat about structure? Does the structure of a human language change the way we think like the structure of a programming language does? Perhaps I find that I can more eloquently express myself in Mandarin than in English on the topic of art, or that I prefer the conciseness of German when trying to explain mathematical concepts. What about taking human languages and learning them to change the way I think about a subject, just as I would mix and match programming languages depending on their utility.\n\nCould I boil a human language down to the extent that I could say with confidence &quot;The best language for describing training exercises to an athlete is Russian&quot;?\n\nI have a proposition: Learn a new spoken language. Learn it well enough to think in that language. Understand and document the way that thinking in the new language changes the way you think. Perhaps it's looking at verb order and what verb order means to people who reverse verbs and their objects? Perhaps it's looking at the use of adjectives, and what it does to the way you mentally describe things?\nI could see this turning into a study of some sort.\nWhen programming, you're looking for a balance of conciseness, eloquency and maintainability when you choose your &quot;words&quot;. If we could do the same with human language, putting a different language into use dependent on the situation, could we maximize our potential as thinkers and by proxy, communicators?"
},

{
		"title": "Coffee Sack Sound Baffles",
		"date":"Tue Dec 27 2011 20:53:53 GMT-0700 (Mountain Standard Time)",
		"url":"/coffee-sack-sound-baffles/",
		"content": "Coffee Sack Sound Baffles\nSeveral years ago I began acoustically treating my studio for recording drums and mixing. I did some research and pricing; it didn't take a spreadsheet to discover that acoustic paneling was both overpriced and hideous. I searched some more and devised a solution that was both economical and classy.\nAcoustic paneling is simple stuff. You get some kind of absorbent material, optionally covered with sonically neutral fabric, and hang it on a surface. You can use spacers to increase the gap between the wall and the panel to increase the amount of absorbency, and of course your choice in material will affect the frequency range, amount of reduction, and all that. Let's skip the science though and get right into the implementation.\nYou will need:\n\nAn Absorbent Material\n1&quot;; x 3&quot;; boards\n1&quot;; x 2&quot;; boards\nFabric (see below)\nNail or screw gun\nStapler\nDry wall fasteners (wing nut style)\n\nFirst, select an absorbent material. You could go simple and use the pink stuff. You know, the insulation they sell at Home Depot with the panther on it. Good 'ol R-30. This material is fine and all, but from the perspective of space it is far from ideal. It's bulky, and in a space as confined as mine I wanted something that wasn't going to shrink my studio by more than a few square feet. I went with Owens-Corning 703 but you've got some other options, like Roxul RHT 80, which is much cheaper.\nThe material I bought comes in 24&quot;; x 48&quot;; x 2&quot;; by default, but can be cut smaller using a razor blade. Wear gloves and long sleeves if you decide to cut it, unless you like that itchy feeling. I went the lazy route and planned my room sans cutting.\n\nThe next step was to build a frame to contain the panel. Sure, you could just duct tape it to the wall, but a frame gives it a cleaner look and allows you to space the panel away from the wall. The frame also gives you something to attach the fabric to. I used 1&quot;; x 3&quot;; cedar boards because they're extremely light and inexpensive, and the panels fit perfectly in them. No need to get fancy with dovetail joints and wood glue, just cut some straight boards and join them together with a nail gun, stapler, screws, or whatever you have laying around. You're dog might casually sniff your frame:\n\nAfter your frame is built, you'll want to attach your fabric. You have a lot of freedom here to dress these panels up, so long as you choose a fabric that will allow most or all sound through. Many tight weave fabrics will reflect frequencies preventing them from even reaching your absorbent material, which kind of defeats the purpose. I went with coffee sacks since I had a ready supply of them, they're sonically neutral, and I think they look cool. Your dog might question your selection:\n\nUsing a staple gun or a fastener of some kind, stretch the fabric across the front of the frame and staple each side. You're probably not going to learn to be an upholsterer here, but try to get a drum-tight frame across the front of the panel, leaving the back open. After you've stapled the fabric around the frame, stuff the panel into the it. Eventually your dog will get tired of whatever it is you're doing an leave.\n\nYour panel should look something like this:\n\nAnd it probably looks something like this from the front:\n\nTechnically you could build a stand or mount of some kind and move this around wherever you wanted, but I opted to hang mine from the walls (and ceiling). I used 1&quot;; x 2&quot;; boards to hang all of my panels. A 1&quot;; x 2&quot;; attached flat to the wall provides a 3/4&quot;; standoff between the wall and your panel when you hang it. First, I cut 2 1&quot;; x 2&quot;; boards just long enough to fit inside the back of my frames. Then, I drilled two holes and inserted a bolt appropriately sized for these wing nuts:\n\nFrom there it is a simple matter of hanging the standoff wherever you want your panels to hang. Mark your holes on the wall, drill where the marks are, press the bolts (already attached to the 1&quot;; x 2&quot;;), then tighten:\n\nTake your panel and hang it on the 1&quot;; x 2&quot;;. You can attach, with screws or nails, the panel to the 1&quot;; x 2&quot;;, but I find it unnecessary. Plus if you leave them free hanging you can move them around if you get bored with the way they look.\n\nThat's pretty much it. I realized that this wasn't particularly novel when I realized that this guy did almost the same thing independently, but I think the coffee sacks were a nice touch.\nOh…and ATS Acoustics offers their own coffee sack acoustic panels…for a price."
},

{
		"title": "Be Careful With your Redis BitSets and Java",
		"date":"Tue Jul 03 2012 20:55:23 GMT-0600 (Mountain Daylight Time)",
		"url":"/be-careful-with-your-redis-bitsets-and-java/",
		"content": "Be Careful With Your Redis BitSets and Java\nA while back a popular article hit Hacker News. Written by the guys over at Spool, it contained a slick methodology for storing metrics such as user logins per day, song plays by user, etc using using Redis BitSets.\nHow about a basic example. When a user logs in, set a bit in a bitset at the location of that user's ID number. If you have a bitset allocated for each day, you can tell for any given day how many users logged in by looking at the cardinality of the bitset. Want to see if a particular user logged in on a particular day? Just check the location in the bitset for that user's ID for the day in question for a 1 value. You can also perform more advanced logging, taking the union of multiple sets, or the disunion, to determine various statistics.\nThe theory behind it is simple and sound. It's faster than hitting an RDBMS for values that are binary in nature, and the ability to apply basic set theory to your bitsets to analyze your metrics is quite powerful.\nI began to use this method and the code examples on the Spool blog to create metrics in a variety of systems, not to mention create silly stuff like prime number tables. It only took a few implementations to realize that the code examples, taken at face value, don't really work.\n## The Problem with BitSet.valueOf() and BitSet.toByteArray()\nThe heart of the problem lies in the output of Java's default BitSet.valueOf() method. Here is one of the examples on the page:\nimport redis.clients.jedis.Jedis;\nimport java.util.BitSet;\n...\nJedis redis = new Jedis(&quot;localhost&quot;);\n...\npublic int uniqueCount(String action, String... dates) {\nBitSet all = new BitSet();\nfor (String date : dates) {\nString key = action + &quot;:&quot; + date;\nBitSet users = BitSet.valueOf(redis.get(key.getBytes()));\nall.or(users);\n}\nreturn all.cardinality();\n}\n\nIf you use the Jedis setbit method to set all of your individual bits, then read the entire set out with BitSet.valueOf(), Java reads the bytes as though they were right to left, whereas Redis stores the values in a straight line. Left to right. The bit sex, as it is called, is reversed in this case, and you can't possibly get an accurate bitset out of Redis if you retrieve it and convert it using plain ol' BitSet.valueOf(). You have to have a tweener method to flip the bit sex for you.\nYou might also think, though it isn't in the examples, that simply performing a BitSet.toByteArray() would create a byte array appropriate for storage in Redis to be read back via redis.getbit(); Not so. Java uses its native byte order for each call. This confuses things greatly, because if you set the bitset using BitSet.toByteArray() and read it back using BitSet.valueOf(), everything _looks_ correct. Try to read a bit out of this array and be prepared for a surprise.\nSome helper methods to get you through:\nI reported this to the guys over at Jedis and they are considering adding some helper methods in their Redis client to alleviate this.\nUntil then, you can use the helper methods that the guys at Jedis and myself created to get you through.\nTo get a BitSet out:\npublic static BitSet fromByteArrayReverse(final byte[] bytes) {\nfinal BitSet bits = new BitSet();\nfor (int i = 0; i &lt; bytes.length * 8; i++) {\nif ((bytes[i / 8] &amp;amp; (1 &gt;&gt; (7 - (i % 8)))) != 0) {\nbits.set(i);\n}\n}\nreturn bits;\n}\n\nTo put a BitSet in:\npublic static byte[] toByteArrayReverse(final BitSet bits) {\nfinal byte[] bytes = new byte[bits.length() / 8 + 1];\nfor (int i = 0; i &amp;lt;; bits.length(); i++) {\nif (bits.get(i)) {\nfinal int value = bytes[i / 8] | (1 &amp;lt;;&amp;lt;; (7 - (i % 8)));\nbytes[i / 8] = (byte) value;\n}\n}\nreturn bytes;\n}\n\nAnd you can see the gist I created to read bytes out and put bytes in, retaining the integrity both ways, and show how things do and don't work. You can run that locally to get something like a code story.\nSo, whether or not the guys over at Spool have an unfortunately named helper method that looks exactly like the native Java one, or use some other methodology to maintain bit order in their bitsets I can't say. It goes without saying that you should check and double-check any ol' method you pull off the streets."
},

{
		"title": "Seven Languages in Seven Weeks",
		"date":"Mon Sep 24 2012 06:00:28 GMT-0600 (Mountain Daylight Time)",
		"url":"/seven-languages-in-seven-weeks/",
		"content": "Seven Languages in Seven Weeks\nIntroduction\nThink about the way you think. Think about that thought, and this one. Did you think using words? Did you see the words? Sound them out mentally? If someone asked you describe yourself, you would probably think of a series of adjectives (at least if you're an English speaker).\nWe think via language, spoken or written. It's the source of our intelligence and in some ways the root of our consciousness. Helen Keller is quoted with communicating that:\n\nWhen I learned the meaning of 'I' and 'me' and found that I was something, I began to think. Then consciousness first existed for me\n\nThe languages you learn are the languages you express yourself with. They mold the way that you think about things and create who you are within your own mind. I've written about this before and it's not an entirely new concept.\nRecently I've gone to great lengths to change the way I think. Finding new ways to solve problems, especially software problems, often involves learning new languages, syntaxes or paradigms. You can force Java or C to do just about anything, just as you can force the English language to *describe* just about anything, but it might be that by using Java instead of Haskell, you're using the wrong tool for the job.\nI wanted to expose myself to a breadth of different software paradigms in as little time as possible. Rather than reading dozens of tutorials, or poring through hundreds of pages of reference manuals to get maximum exposure, I bought a book I called [Seven Languages in Seven Weeks][8]. Packed into this dense little tome is an overview of seven syntaxes from different families and programming paradigms.\nThe Languages\nRuby\nThe book begins with Ruby. It's a fairly common syntax and I considered skipping this chapter. Indeed, with the relative ubiquity of the language I wondered why it had been included at all. In the spirit of playing along with the author I read through the sections and did the exercises as described. It turned out to be a good idea; some of the concepts around using method_missing as a DSL generator I had never put into practice.\nFrom a comfort standpoint starting with a language you're familiar with is also a bit like reading the introduction to a Latin grammar text book in English. I know the language and therefore the author can present his approach to me with words I can understand before I try to make my way through the rest of his presentation.\nSpeaking of presentation, Tate clearly has a grasp of basic pedagogy. From the beginning he uses a mnemonic device to help the reader put a face to the chapter and the methodology. For Tate, every language is like a character in a movie. They have their own personalities; something that makes them unique within the dozens of lexical environments out there. For Ruby it's Mary Poppins. You know, syntactical sugar. Get it.\nIO\nAfter Ruby Tate introduces a language I had never heard of, Io. Just try searching for information about this little language on the web. You won't exactly find the throbbing community that surrounds java or ruby to back you up. No, if you choose to use Io to solve something new, you'll likely find yourself in uncharted territory. Not necessarily a bad thing if your approach to the text is to learn new ways to think.\nA prototype language, Io is described by Tate as Ferris Bueller. In use I got the distinct impression that Io was heavily influenced by Smalltalk; everything you send is a message, and their are nothing but senders and receivers of messages. Method or function? Not really, there are 'slots' with message handlers. Can they be construed as the same thing, abstractly yes, but that is to avoid thinking in a way that make the language unique. Sending messages between objects is a powerful concept, and will help you better understand Objective-C and Smalltalk.\nUsing Io feels a bit like working in JavaScript, the only other prototype language I have any experience with. The concurrency framework is dead simple and provides the reader with a taste of things to come from languages like Scala and Closure. In fact, the actor framework in Io is so simple and impressive it feels like a great environment in which to teach concepts of asynchronous behavior and concurrent development.\n\nProlog\nAfter Io we get to Prolog, the most frustrating language paradigm for me to grasp in the book. Tate says Prolog is like Rainman. That must make me Tom Cruise.\nThe logic programming paradigm was at once the most fascinating and frustrating for me to study. At first I was enthralled. A language that I can plug values into and simply query against to get the answer like a super-powered database? Sign me up. I immediately found myself fighting the syntax. It took me some time to grasp the recursive nature of the language as well; no looping structures.\nSolving the sudoku problem at the end is the best example of the power of Prolog and languages like it. Reducing a game to a couple of line of syntax, injecting the rules and simply asking questions is a beautiful way to solve many of the problems modern engineers are presented with... if Rainman doesn't drive you nuts along the way.\n\nScala\nWith Scala we take a detour back to familiar territory. Scala is the first variant on the java language I'd had the opportunity to use, so when I began the chapter I had some exposure to it. Most of the concepts in this language sunk right in.\nTate says we can think of Scala as Edward Scissorhands. He is the construction of spare parts and a lot of paradigms that already exist. I prefer to think of Scala as MacGuyver; It can do pretty much anything in a pinch. Scala was a comfortable environment to take a break in for a while. It sports functional programming paradigms like higher-order functions, while retaining many imperative concepts held over from C-based languages. Its also completely interoperable with Java, so all of those libraries we've grown attached to like joda and jsyn can be reused in the same lexical environment.\nFor concurrency Scala provides an actor system, much like Io. Tate clearly planned the book to address concurrency in a methodical way, first by introducing simple examples with Io, then advancing to Scala before diving headlong into the deep waters of Erlang and Clojure.\n\nErlang\nThings get uncomfortable again as Tate introduces erlang. From the get go Erlang baffled me, and when it was revealed that it was modeled after Prolog, I understood why. The only language compared to an antagonist in a movie, Tate describes Erlang as Agent Smith from the Matrix. Tate says that this is due to the self-replicating capabilities of Agent Smith in relation to the fail-safes built into Erlang, allowing the user to build highly fault tolerant concurrent systems that &quot;just won't die&quot;. I think it's because Erlang is evil.\nErlang is clearly very powerful, so as with Prolog I struggled through the examples and problem sets. I still don't feel like I fully grasp how to do anything useful with it. Of the languages in the book, I feel like this is the one I need to spend the most time with to really understand.\n\nClojure\nNext we get a lisp. Clojure, a language fully compatible with the jvm is a lisp not at all unlike Scheme, minus a few parentheses. For Tate this language is like Yoda, no doubt due to the reverse notation of the arguments and the inside-outness of the code construction, at least compared to C.\nSurprisingly, I took right to it. Of the new lexical environments this felt the most comfortable, but then, I've played with emacs a bit. The concurrency framework is not at all unlike scala with some notable additions. The concept of STM was awkward at first, but after fiddling with it for a while I was comfortable producing usable code.\nThe interoperability with Java is another major benefit to using Clojure. For Dijkstra's Sleeping Barber problem, rather than struggle through writing a queue from scratch, I just borrowed the existing Java LinkedBlockingQueue, cranking up one actor to poll it, and another to deliver to it:\nIn just under 1000 parentheses the barbershop problem was solved. The wrapper around it is unnecessary, but then the whole solution is a little bit wordy for Clojure.\n\nHaskell\nImpressed as I was with Clojure, it was time to study the final language in the book, Haskell. I originally selected the book based on the inclusion of Haskell. For some time now I've wanted to take a crack at this pure functional, almost entirely mathematical language.\nCompared with the ever logical Spock, I'm still dazzled by Haskell. Having read the chapter and gone through the exercises, I feel like I've only scratched the surface of what it can do. It's unofficial tag is that it makes hard things easy, and easy things hard. That ain't no lie. Try reading a file with it. Do something simple, like open a socket. I feels like pulling teeth. Now go write a Fibonacci solver. Chances are you'll have cooked up something that can't be done as succinctly or quickly as Haskell can do it. Of all the languages in the book, this is the one I intend to dig the deepest with.\nWrap-up\nWhen learning anything, I generally feel like a breadth-first overview is the best method of getting started. When learning new ways to think, this breadth-first search seems even more important. Get all your options on the table, see what's been discovered before deciding how to tackle the problem. Selecting a strategy to go deeper with is a decision that can always be deferred until you know what your strategies are (Of course, you can only defer for so long before you just need to make a damned decision based on what you already know).\nThe real value of Seven Languages is that it provides this kind of breadth-first overview. You may know Java or C already. That's great. What else is out there? What can a language like Io make easy? Clojure will help you understand lisp. Haskell will help you understand _any_ functional and improve your understanding of modern math. Scala will let you build damn near anything.\nTate's progression makes a lot of sense as well. If I was creating a curriculum to prepare a developer for the real world, I would start a youngster out with something like Ruby. This is an obvious ramp into Java and C. Then I might introduce something like Io to explain prototype languages and concurrency in a simple way. This is an step towards a better understanding of both Javascript and Objective-C. Then I might start them on Scala. It's maximum exposure to as many concepts as possible. From scala, Learning a functional language is made easier if the programmer has been using Scala's higher-order stuff like fold and map, and is used to immutable variables. Tate's text provides a decent way to do all of this, introducing a young developer not only to the syntaxes but to paradigms that are broad enough provide insight to damn near any language out there.\nIf you're interested in seeing my solutions to the exercises and problem sets, you can find them here. I learned a lot along the way, and I think I achieved the goal I had set out to achieve: Learning new ways to think."
},

{
		"title": "Cruel Jewel 50 - 2017 Race Report",
		"date":"Mon May 22 2017 10:54:41 GMT-0600 (Mountain Daylight Time)",
		"url":"/pages/cruel-jewel-50-2017-race-report/",
		"content": "Before we get into this, I want to clear up a few things:\n\nTrekking poles - Bring them with you. Take them out immediately. Don't bother putting them away. This isn't Umstead or the Virginia Creeper trail. Some points of the race are so steep that you can reach out in front of your face and touch the ground. The downhills are straight down, because you know, who likes switchbacks.\n\nSalt - Its Spring in the south. The temperature will be somewhere between stifling and oppressive. You're going to sweat a lot. Take somewhere close to the lethal dose of salt for you height and weight for the day.\n\nRain Gear - Its still Spring in the south. The humidity is either 90% or raining. If its the latter and you're 16 hours into the race at night on the side of a windy bald, you're going to get wet and cold. I made the mistake of eschewing rain gear and was shivering in my short-sleeved shirt for the better part of 10 miles in a raging thunderstorm. It might encourage you to move your ass, but see notes on trekking poles; you can only move so fast on terrain that is fondly referred to as the Dragon's Spine (or as I normally refer to it between heaving breaths, the worst-trail-in-the-world-dear-god-why-do-I-keep-coming-back-here).\n\nIt's 56-58 miles, not 50. That matters. And don't go thinking that you're halfway through at mile 28. When you hit Skeenah Gap at mile 34ish, look at your watch. Double that time; thats probably how long its going to take you to clear the last 22 or so miles.\n\nAlright, now that we've got that out of the way, let's begin.\nThe 2017 Cruel Jewel 50 started at 8:00 on Saturday May 20th at Camp Morganton in North Georgia, 20 hours after Cruel Jewel 100. I woke at 6:30 AM full of anticipation, water, and salt. My wife had been feeding me salty this that and the other for a full 24 hours. I packed my gear and headed to the Camp with plenty of time to mill around, chat with my friends, and fret over the day to come. 100 mile racers were rolling in from their efforts the prior day; few looked chipper as they taped their toes and waddled like sweaty penguins back on to the course. I had a lot to look forward to.\nMy pack was full of salt, protein drink, tailwind, salt, some snacks, water, salt, trekking poles, chapstick, and some salt. I'd been training for a solid 6 months for this effort, repetitively running up and down Kennesaw Mountain nearly every weekend, and slogging away on the stairmaster at least once a week. I packed that away as well. At 7:50 AM the RD scraped a line across the gray gravel path outside of the camp with his foot; the starting line. After a few shouted announcements, we were off. 100 or so raving lunatics took off down the path to Snake Nation Road, and the race was on.\nPaces varied between &quot;Why am I running so fast?&quot; and &quot;Am I going out to hard?&quot;. I tried to stay in the latter camp, and several runners pushed ahead of me on the easy section of open road leading to the first trailhead. I was playing it safe today, and didn't mind being toward the back of the pack at the start; it was going to be a long day. The heat of the open road was mounting, but as we caught up with some of the 100 mile runners they confirmed some positive news; it was better than the day before. The temperature would reach a mere 86 degrees today compared to Friday's 90, and the humidity had miraculously dropped into &quot;Sweating actually matters&quot; territory.\nAt some point on Aska Rd, we turned out onto the first trailhead under welcome shade at Deep Gap. I was still a bit anxious on the initial loop. Had I taken in enough salt? Running with Matt, he informed me of his strict schedule during the heat of the day: 1 SaltStick every 30 minutes. It seemed like a good strategy so I adopted it. Barely 4 miles in we deployed the trekking poles. They never went back in my pack.\nHeading up Davenport Mountain was a good taste of things to come. Not so steep that you're filled with self-loathing over your decisions in life, but no picnic either. I carry too much upper body weight to be a stellar runner, but the trekking poles made up for any genetic disadvantages I may have as a runner. In no time we were headed back down to Deep Gap Aid Station.\nOn the way down the mountain I had a niggling sensation in my right calf. My nemesis, the muscle cramp was creeping up. Matt's schedule of 1 SaltStick every 30 minutes may work for him, but I was going to have to up the ante to stay ahead of ol' crampy. I started popping those bad boys once every 15 minutes until the sensation passed. If I made any good decisions during the race it was that one. By the time I reached Deep Gap again at mile 8.5, Lord Crampus was satisfied with my salty offerings. I still ate a handful of potato chips as extra appeasement.\nWe headed out onto the trail again, ready to link up with the Benton-MacKaye trail. I have no idea who Benton or MacKaye were, but they sure knew how to cut a pleasant trail through the mountains. The descent to Weever Creek Rd was difficult; I later found that we'd be climbing right back out of the hole we were rushing into, but the trail was so damned beautiful I didn't mind. We passed several 100 milers, looking tired but determined on their way up the trail. These guys and gals had soldiered on for almost 24 solid hours now and were a little more than halfway through. I did my best to raise their spirits and send some positive vibes their way, and pay my respects as I let them pass on the crowded single-track trail. If my day was hard, their's was hellacious.\nAt Weever Creek Rd I had the chance to catch up with old friends, give a few sweaty hugs (Thanks Sarah!), eat a few salty chips, and gulp down some pickle juice. Pucker up. 13.5 miles in and it was time to re-fill the packs with water, salt and Tailwind. If my mood was anxious at the start, I was quickly heading towards elated. Matt and I stomped up the trail out of Weever Creek road toward Stanley Gap and the next aid station.\nThe climb up Rich Mountain is similar to Davenport. You won't question your existence or see the White Buffalo, but you're going to do some work. We trudged ever upward, passed several runners, and by the time we reached the top the game was finally on. The descent down Rich Mountain is a steady drop to Stanley Creek, and the perfect place to make up some time. I took advantage of my good mood and the conditions, put a smile on and took off. Somewhere in here I lost track of Matt but ran into several other runners that I'd see throughout the race. People had come from all over to experience this: Chicago, Dayton, the Philippines. How lucky am I to have these proving grounds in my backyard?\nAt Stanley Creek aid, almost 19 miles in I was craving nothing by ice cold coke. I never drink coke, but today the caffeine and carbonation were right on the money. I had several refills, more pickle juice, and literally drank from the salt shaker. The next section started with a few miles of open road, and the sweat was already flowing in the 85 degree heat.\nThis segment of the race started fast and furious. The road is relatively flat, so if you're feeling fresh you can make up some time here. The sun was oppressive so I remained cautious, but packed in some quick miles here before the onslaught of the trail again after Old Dial Rd. Along the way I encountered a few 100 milers still doing the work, still getting after it. I walked with a woman from Canada who was looking a little sleepy. I donated my emergency caffeine gel to her, and we kept on until we hit the Toccoa river. It was too tempting to pass up; she got in and sat down for a while, and I dunked my hat and threw it back on. It lit us back up. I left her with another 100 mile competitor and headed up the trail. A few more miles of ups and downs to Old Dial Rd where my crew (wife) and friends were waiting.\n\nBy the time I reached Old Dial people around me were starting to think I was high. I wore a permanent smile and did my best to spread my mood to anyone I encountered. Cary, Bill, and Nikki were waiting on our fellow runners there. I felt positively pampered. Bill and Cary helped me fill my pack. Cary had made me some miso ramen noodles on a camp stove, and even though I didn't feel like I needed to sit down, I gave myself 2-3 minutes to suck down some noodles and salty broth. The soup was hot, but really hit the spot and packed away another reserve of salt for me to draw on. Aaron, friend and 100 mile competitor wasn't too far ahead. He'd had some early struggles with nausea in the brutal heat but was pushing ever onwards. I wanted to catch up and spread some good energy. I grabbed another cup of coke before heading out up Garland, Brawley Mountain and Bald Top.\nA few miles in I encountered Aaron and Ivars. They were taking a rest when I came up on them, and I probably annoyed the hell out of them, but rest time was over and we got moving again. Hopefully it wasn't to their detriment. We were on one of the hardest sections of the BMT during one of the hottest parts of the day and I count it as a blessing that I encountered these guys when I did. We all slowed down and trudged up and down together, bantering about ultrarunning, youtube, past races, and what we were planning at the next aid station. There are few things in life better than shooting the shit with your friends on the trail. In no time we'd hit Wilscot Gap.\nAt Wilscot we'd agreed to hide away in our crew's cars for a few minutes and spend some time in the AC. Rich Schick had suggested this strategy to me a few days ahead of the race, and it worked like a charm. 5 Minutes in the cool air, some ramen noodles and coke, and I was a new man. Caitlin, who'd spent the morning pacing fellow friends, was going to join on and march us over Wilscot to Skeenah Gap. A lot of runners stress over the effort ahead of them. Caitlin drinks a beer, shrugs, and says &quot;Lets get on with it&quot;. I didn't drink a beer, but the attitude was inspiring so I took that with me along with the excessive runner's high I was experiencing as fuel for the effort to come. Aaron and Ivars got a little rest in the car as well, and after some changes to provisions were ready to head back out towards Skeenah Gap.\n\nThe climb up Wilscot Mountain is rough. You're getting closer to the real deal on the Duncan Ridge Trail; this is really the last hurrah of the relatively pleasant BMT. We trudged on toward the top, taking almost no breaks. The heat was abating and I was sweating less. I started to reduce my salt intake and stuck mostly to Tailwind, protein drink and water. Around the top of Wilscot I looked at my watch. I'd been at this for almost 10 hours now, and I was about to reach the last pleasant aid station before the real work began. Extrapolating ahead to make the finish in fewer than 20 hours, I decided it was time to break away and make for Skeenah on the double. Coming down Wilscot I went for it, and hit Hwy 60 at Skeenah Gap at a full run where the whole crew was waiting.\n\nI got a lot of help from Cary at this aid station, the last time I'd see her before the finish. I refilled on protein drink one final time, topped off the rest of my fluids, grabbed a Snickers and slapped my headlamp on for the night. Dark clouds descended and the smell of turned over soil permeated the air. It was going to rain. I hadn't brought any rain gear; I figured if it did rain it was hot, so it wouldn't matter. I had neglected the cool mountain air, and didn't appreciate just how much rain we were going to get. It was looking ominous as I waved goodbye to my wife and friends at Skeenah up the long climb to the Duncan Ridge Trail and the finish.\n\nThe climb out of Skeenah is notoriously steep. There are multiple false tops where you feel like running might be an option, but around every turn is another uphill march. It continues for several miles until you hit the Duncan Ridge trail, and make the left turn into the hills from hell. The race prior to this point was the warmup, and downright pleasant in comparison. It was time to get to work on the spine.\nThe sky dripped and the wind raged just as I saw the first blue blaze. Thunder in the distance signaled the oncoming storm, and I passed several 100 milers who had stopped to gear up for the drenching. Rain is usually my element. It cools me, my sweat rate drops off, and I typically pick up the pace dramatically. The sky opened up just before nightfall, and so did my pace. I wasn't too cold yet, but I moved fast up the steep inclines and carefully quick on the declines. Several times I surfed the mud for 5 or so feet, only my trekking poles kept me from taking a butt slide or going over forward. I still don't know how I managed to make it through the entire race without a single fall.\nI could tally off the mountains, gaps and balds that you have to cross on your way to Fish Gap, but this race report is already dragging on. The only advice I can give is to put your head down and march upwards. Stop and breathe when you have to. Smile, you signed up for this. Use gravity when you can, carefully, on the downhills. Just keep moving forward.\nThe space between Skeenah and Fish Gap is a bit of a blur. Its a long section whether you measure by time or mileage. The lightning lit the sky every few minutes, illuminating everything on the dark trail for an instant. I'm certain I heard boar in the underbrush. Other runners claim to have heard bears calling. I think I saw the shadow of at least 20 in the distance every time lightning struck. That might have been my imagination. The rain and fog were so thick that using your headlamp on anything but the lowest setting was impossible. I just pressed onwards until the welcome light of Fish Gap appeared in the distance through the rain.\nIt was a dark moment for many runners at Fish. 100 Mile competitors had been at this for over 30 hours at this point, exhausted and underfueled, they were cold and hypothermic. Shivering under a tent or beside a fire, many decided to call it quits here, so close to the end. Many considered it, but hardened up and carried on. I ran into Mark, working his way through the rest of his 100 mile effort and looking really good! I crewed and paced Mark at the Bear 100 in 2016, and knew from experience that he could turn it on at the end of even the toughest races. Today was no exception. I made my stop quick. I was getting cold in nothing but my short sleeved shirt and needed to move fast to keep my body hot. I ate a few snacks, some coke without ice, and pressed on.\nThe next section of the race is in my opinion the toughest. Your tired legs are begging for rest. There is no such thing as a flat section after the first quarter mile out of the aid station. If you're not ascending, you're descending. To some degree I count it as a blessing that I was wet and cold. It made me move when I wanted to stop. The rain let up for a while, but the damage to the trail was done. Slipping and sliding on the bare mud was the rule for the rest of the race, and any chance of picking up speed on the downhills was out of the question. It was better to play it safe and finish rather than risk taking a spill off the trail to improve my time. Besides, I was already having a good time, so what did my finish time matter? Somewhere in here I met up with a few runners who were marching at exactly my pace, and I stuck with them for some good conversation about bears, beers and family. The previous 10 miles I'd covered in relative solitude, it was good to have folks nearby for a while.\nBy the time I reached White Oak Stomp I was starting to feel the effects of a very long day on my feet. I was still happy to be out there, but ready for the race to be over. I had warmed back up since the rain had stopped to little more than a sprinkle, but still made my rest brief. It was here that I ran into friends Wes and his pacer TJ. Wes had taken a spill early on that earned him a softball sized welt on his right calf. By some miracle of personal fortitude he had put this injury aside and managed to get out in front of our normal crew of racers over the course of 90+ miles. Taking a little rest at White Oak Stomp to change out a few articles of clothing, he looked ready to take on the rest of the race. Ellen, who I'd met in the previous section was ready to head out of White Oak right when I was, so we trudged out together.\nThe hike out of White Oak is as steep as it gets. Here you can touch the ground in front of your face as you ascend. Its a relatively brief climb, but brutal. We reached the top heaving a bit, and started making the long, treacherous descent. This three mile section is hard to take even in good conditions; the slick trail meant constant sliding, testing foot positions, and struggling to stay upright. I had several near misses, but Ellen kept her footing nicely. It was long and slow, but not impossible. I sympathized with the 100 mile competitors; every footfall is work at the end of a 100, every one of these steps were extra credit.\nThe sky opened up again during the descent into Wolf Creek. The going was so slow that I was having a harder time keeping my body temperature up. I was begging for some uphill as we approached the bridge at Wolf Creek, and the race delivered just in time. The last aid station is just a water stop. We walked right on by; the torrent of rain was plenty to drink if you just opened your mouth a little as you hiked.\nThe trail had turned into a creek bed of ankle deep water. The last 4 mile section is plenty runnable in good conditions, but a barely hikeable swamp when wet. We slogged ever upward, getting quieter as I began to shiver. We both wanted this race to be over. We reached the road suddenly, and I knew the rest of the trail very well. We crossed down the stairs and into the park. I bid Ellen adieu in an effort to move quickly and get my body temperature up in the last 2 miles. I was at a dead run when I hit campsites at Vogel, and the rain was driving hard all around me. As much as I could sprint at the end of a 50 something mile race, I did. The horse had smelled the barn, and I was ready to cross the finish line and find a nice, hot fire. In the pouring rain, to a crowd of perhaps a dozen, I crossed the finish line and accepted my belt of victory. To an outsider, the end of an ultramarathon may seem anticlimactic, but for me its a reminder that the joy was in the running, not in the finishing.\n\nMy race was over, but my day wasn't. I still had friends out there working their way toward the finish, and I wanted to be around to see them cross the line. After a quick bite to eat, I peeled my shoes and wet shirt off, hopped in the car to get to our hotel room for a quick shower, then headed back to the finish line. One by one friends new and old were rolling in. Wes survived his early injury and crossed with TJ with confidence. Mark managed to stay awake and crossed the line shortly afterwards. Matt had caught up to Aaron at White Oak stomp, and a few hours later they crossed the line together at a run towing a crowd of fellow combatants with their pacers. A highlight of the finish, Ivars appeared minutes behind Aaron, at a full sprint, decked out in a red cape he'd fashioned for himself from a red Georgia Bulldogs tablecloth he'd found at the aid station. Ivars had fallen asleep for a spell and when he woke, was completely re-energized, if a bit cold. He'd solved his hypothermia problem ingeniously and hilariously. It was inspiring to watch these guys and gals fight their personal struggles out there and overcome them all to finish, come hell or high water (and we had both).\nAfter the requisite post-race elation, we congratulated each other on a job well done, and planned our next battles. As drowsiness started to set in, we said our goodbyes, satisfied with the weekend's work.\nPeople seem to think running is a solitary. Absolutely not. You have the support of the good people who volunteered their weekend to work at aid stations, make you grilled cheese sandwiches, and teach you what a Pickleback cocktail is. You have the folks who spent the days prior to the race marking trails so you don't get lost out there. Many of us have crews and friends out there to give us aid and to keep an eye on us. You have your fellow runners out there on race day, reminding you that this is only 10% race, 90% community. You have your training buddies, keeping you honest and making sure you get out of bed for the long hauls in the months prior to the race. You are literally surrounded by friends and supporters the entire time.\nI'd like to thank the Race Directors for putting on a hell of a good show. But most of all I'd like to thank my wife, who tolerates many long hours of training, and sacrifices weekends to come out and support me whenever she can. In the days leading up to the race and for the duration of the struggle, nobody helped me more than she did. I'm lucky to have her by my side."
},

{
		"title": "High Lonesome 100 - 2017 Race Report",
		"date":"Mon Aug 07 2017 04:26:40 GMT-0600 (Mountain Daylight Time)",
		"url":"/high-lonesome-2017/",
		"content": "High Lonesome 100 - 2017 Race Report\nWe staggered up the last few steps in the dark to the top of Monarch on the Continental Divide trail. A relentless wind slapped me in the face, and kept on slapping. A chill burrowed into me despite the wool shirt, rain jacket, gloves and buff. I couldn't see more than three feet in front of me; it wasn't fog, we were standing in a cloud. I turned back to Aaron, now nothing more than a diffuse headlamp glow and a voice in the dark.\n&quot;We gotta get the hell off this ridge.&quot;\nWe broke into a run, anxiety fueling our effort. We hadn't eaten anything in several hours. We were wet with sweat in the cold, constant wind. Slowing down could mean hypothermia. The day before had been perfect.\nHow the hell did we get here?\n5:45 AM, Friday\nHundreds of people milled around in the dawn chill at the campground on Mt. Princeton. Pictures were taken; all smiles. Seventy-three of this crowd were preparing to toe the line of the inaugural High Lonesome 100. I was one of them.\n![Dudes][2]\nThis was my first one hundred. Hundred-miler. Hundo. Finally hunting some big game. A few months prior I had no intention of being on the side of that mountain, but a [successful fifty-miler][3] seduced me to strike while the iron was hot. Besides, all my buddies would be there, and who doesn't like a little peer pressure. I got on the waiting list and within a few weeks I was committed.\nAt 6:00 AM, to the crack of gunfire, we rushed out of the campground in a mass and expelled our nervous energy on a steep downhill road towards the Colorado Trail. After a few miles the paved road degraded into a wide, flat, dirt path. We clicked off several quick miles before the real hunt began.\nA steep ascent marked the beginning of the Colorado Trail. I'd be lying if I told you I remember it this way. I only recall this ascent the way back, with ninety-four miles behind me. It was an easy climb going out; it would be a quad-killer coming back.\nWe peaked out on the initial climb, and were rewarded with some nice, flat, runnable terrain of Colorado Trail. It didn't take long to make it to Raspberry Gulch, the first aid station.\nBy now our group of runners, all flatlanders from the Atlanta-area, had split into their respective factions. TJ had spent the better part of a month in Colorado, and had acclimated well enough to take an early lead. We would see him only once more before the finish. We'd instructed our crew to get some sleep, get their supplies, and skip these first few aid stations; we'd catch up with them around mile twenty-five. We filled up on water, grabbed a few snacks (Nutella tortillas? Hell yeah), and headed out for our first big climb: Antero. 9 miles ahead.\nIt didn't take long for the going to get tough. Aaron and I ascended the trail into ever thinner air. We came across flatlanders and highlanders alike, all struggling to make meaningful progress up the long hike. Our easy run was reduced to a power hike, and then a trudge.\n&quot;I gotta take a picture of this!&quot;\nThat was my excuse anytime I wanted to stop and breathe for a minute, and the scenery made it easy. We were surrounded by mountains, bare on top, green on their slopes, rocky at their bases. White snow pack salted the peaks, gathering in nooks and crannies between folds of the ridge. The melting ice formed a half dozen creeks, streams and waterfalls that poured off the sides of the mountain, rushing toward flatter terrain. It was a mountain paradise.\n![Mountain Paradise][4]\nIt was also a struggle. We worked with the mountain; we slowed to its speed. It might be the altitude talking, but by the time I reached the top I no longer felt spent. There was peace up there that I cannot describe.\n![Peace up high][5]\nAt the top, we looked down the side of the pass onto a steep jeep road. Perhaps a dozen rocky switchbacks wound their way downward toward our next aid station. If the previous five miles were toil, this was an effortless fall into a forested abyss. The scenery remained stunning, and with smiles on our faces we strode in to Antero aid.\n![Into the Basin][6]\nWe made quick work here. The trail continued to descend out of Antero onto a roughshod jeep road. We passed several trucks on our way down. Several times the trail coincided with a melting snowpack stream; a taste of things to come.\nAfter several miles of descent we turned a corner to hear cheering. Were we at the aid station? Had we covered eight miles so quickly? No. Several members of our crew had found a spot where the road and jeep trail met, parked, and waited for us to pass. It was uplifting, even if it did mean we still had several miles to go until St Elmo.\n&quot;I think the worst is over,&quot; I commented to Aaron.\n&quot;I ran parts of this course during training,&quot; another runner interjected. &quot;I think the next out and back from St Elmo is the worst.&quot;\nWe were ignorant of the course other than the elevation profile and map. On the topo map it just looked like a couple of hills. How bad could it be? We contemplated as we ran up the Alpine road and past the creatively named Alpine lake. It didn't take long before we arrived at St. Elmo.\nSt. Elmo was supposed to be a ghost town; it looked anything but ghostly as we passed through. The hustle and bustle of runners, their crews, and race volunteers transformed it into a mountain metropolis again for the span of 24 hours. In the traffic we saw Anthony Lee and Mike Wolfe, the front runners, exiting on their way to Tin Cup and the rest of the race. They were hours ahead.\nThe aid station itself was on the trail about a half mile past the old town. Our crews had made quite a hike to get our gear from the parking area to the station itself, a thing which we'd hear a lot about later on. We took a quick break, our crew forcing us out after 5 minutes, and began the trek up and down to Cottonwood.\nThis was a low point. The rain hovered like an indecisive spectre. The clouds obscured much of the scenery. When you're on cooperative terrain you don't notice. But when the mountain feels like it's working against you, the weather does too. If it had been sunny and hot, I'd still be complaining. There is no solution to the problem other than to stash your ego in a pocket and get to work.\nThe going was slow, even coming down the backside into Cottonwood felt like work. How could two little blips on the map compare to the pass at Antero? We caught up with TJ, making his return trip from Cottonwood, looking strong. After a few minutes conversation, we let TJ continue and struggled on. At Cottonwood, our break was short. We headed back the way we came.\nOut and backs bend your mind. On the way out you might complain a little. Your way back is a gripefest. Now you know where to complain. You just saw this. You know that &quot;this next section&quot; is muddy, slippery and steep. You're probably going to fall. There is that tree where the incline gets rough again. There is that clutch of grass that marks where all the damned rocks are. This kind of thinking is unavoidable on an out and back.\nAs we approached St Elmo, we caught up with Matt on his way out to Cottonwood. We did our best to lift his spirits without being dishonest about the beast in front of him. Forget the thin air and just keep moving. It was a struggle for everyone, and I know I learned something from it: on your way out, better to forget.\n![Approaching St. Elmo][7]\nAfter powdering my joints on the descent, we met our crew again at St. Elmo. I was burning up despite the dreary rain and stripped off some clothes. It was getting late; the sun would be down before we arrived at the next aid station, so we grabbed our night gear. A quick shoe change later and we were on our way.\nThe next few miles of flat road flew by as daylight expired. We hit the water drop at Tin Cup, signaling the end of the road and the beginning of the ascent over the ridge to Hancock.\n&quot;Hey Yogi!&quot;\nAaron's cry startled me. Our energy was flagging; conversation was limited to occasional grumbling. Sometimes about the knee-deep mud, other times the endless ascent over the ridge. It was getting too quiet, and we needed to make more noise to encourage our bear friends to stay far away.\n&quot;Hey BooBoo!&quot; I called back.\n&quot;Go away, bears! Nobody likes you!&quot;\n&quot;Nothing to eat here!&quot;\n&quot;Fuck off, bears!&quot;\nIt always devolves into profanity.\nThe bears weren't the only things we were cursing. As the snow melts in the mountains of Colorado, rivulets of ice-cold water form and wheedle down the mountain. Sometimes they mind their business and gently cross the trail. Other times they get lazy and just share the trail with you. I don't mind the occasional creek crossing, but after several miles of running in what can only be described as an &quot;ankle deep kinda ice river&quot;, I was pleading for dry feet.\nSpeaking of snow, during this leg of the course we encountered our first snowpack. What's snowpack? It's a big slab of melting, soggy, but still somehow slippery snow that sprawls across the trail like Jabba the Hut. Its too big to run up-mountain of, and if you slip and fall you're going to end up &quot;down mountain&quot; pretty quickly. In my first encounter I tried to gingerly [prancercise][8] my way across and ended up with one pole jammed into the downhill side of the trail, the other end under my rib in a feeble attempt to slow my roll. A few feet of butt-waddling and I was back on dirt trail, but it was a close one. On my second attempt at snowpack I didn't even try to stay on my feet; I unceremoniously plopped to my ass and slid until I was across.\nAfter several wet, steep, and muddy miles we arrived at Hancock, bear free. Mile 48.8. Halfway. Sort of.\nWe had expected our crew at Hancock, and were surprised to see that they hadn't made it. We took a long break here to try and give them time to catch up. Wes, our pacer had planned to step in to get us through a couple of tough climbs. I needed some warmer clothes. Luckily both Aaron and I had packed a drop bag for Hancock in case our crew couldn't make it. I switched into a long-sleeve wool shirt and stretched a buff over my head. On the verge of shivering, we dragged ourselves out of the comfortable camp chairs and dawdled to the exit. One last look around; our crew hadn't arrived. It was just Aaron and I until Monarch Pass, mile 66.6.\nThe trail to Middle Fork, between Hancock and Monarch, was eerily similar to the trail from Tin Cup to Hancock. Oftentimes I found myself asking if we were walking back on the same trail.\nMemory is tricky. I don't remember much in here. I'm sure this portion of trail was difficult, fun, muddy, bear-free, but in retrospect what came after Middle Fork overshadowed it. I find it hard to recall anything that happened between Hancock and Middle Fork. I'm certain I found plenty of opportunities to worry about my pace, yell at bears, and curse the altitude.\nI remember ending up in a forested area on switchbacks descending into a gap. I knew we were getting close. You could hear occasional cheering in the distance as a runner approached Middle Fork. When we arrived, there were many butts in seats. A volunteer told us that &quot;visibility was pretty low, and we've gotten reports that there was some wind up on the ridge.&quot; We wasted little time here. Snacked and hydrated, we set out on what would become the most brutal climb of the race.\nThe ascent was immediate. The grade prevented anything but the slowest hiking. With burning legs and lungs we forced ourselves forward. As we ascended we came across other runners, flatlanders like ourselves getting our first taste of Monarch. I vividly remember crossing a bridge, a torrent of ice cold water beneath us. I remember looking up to see headlamps in the distance. I remember saying &quot;Are you fucking kidding me?&quot; when I realized how much higher those headlamps were. We were tricked multiple times by false tops and ridges, the exhilaration that we were done climbing into the thin, dark air rudely stamped out by the unfeeling mountain.\nThe effect of the high altitude and sleep deprivation on our minds and bodies was at its worst as we approached the top. We stumbled through the fog-thick dark, sometimes taking only five or six steps before sitting on one of the boulders that littered the trail. Delirium wasn't far off. We didn't eat. Eating meant chewing, and there was no extra energy for chewing. Who can chew and breath this air? The last few steps were agony.\nAnd then we topped it.\nIn only a few steps we knew we were in a worse position than before. Exposed atop the ridge, the wind pummeled us, the cold mist chilled us to the bone, the air was still thin, and we were wet with sweat from the climb.\n&quot;We gotta get the hell off this ridge.&quot;\nI must have repeated it a dozen times as we ran. Trail flags seemed sparse. Hell, the trail seemed sparse. One moment you think you're on it, the next you're running through a patch of bushes. Several times we stopped to check direction. Several times we ran in a direction not knowing if it terminated &quot;down mountain&quot;. At one point Aaron lost the trail. I turned around to guide him back with my headlamp. I couldn't tell if he was ten feet behind me or a thousand. I walked back until we were both on what appeared to be the trail.\n&quot;What do you boys say we get the hell off this ridge!&quot;\nIt was Wes! He appeared out of nowhere. Our crew had arrived at Hancock fifteen minutes after Aaron and I had departed hours prior. Cary asked Wes what he wanted to do, and like a pro he suited up and jumped in at Hancock to catch up with us. He fought out there alone in the mud, in the dark, probably yelling at bears, up that damned climb and caught us just as we were at our lowest. His timing was perfect. Wes lifted our spirits, shepherded us along, and forced us to eat something. Soon enough we could see trees through the fog and knew we were back below tree line.\nThings started to look up as we descended. Staggering delirium subsided and the trail opened up onto a wide ski run. On a high visibility night this would have been a godsend, but when you're limited to three feet of visibility, a twenty foot wide trail is hard to keep track of, especially when you're looking for trail markers. We split up three wide across the trail to make sure all sides were covered and we didn't lose track of a turn.\nAs we shuffled down the pass a huge weight was lifted from my chest. No more high altitude. No more big climbs. No more exposed ridges. Once we hit Monarch Pass at 66.6 miles, the rest of the run would be no more than 10,000 feet. A blissfully oxygenated 10,000 feet. And we were way ahead of cut off. The combination of Wes' arrival at the lowest point in the race and the knowledge that it was easy street from here renewed me.\nWe arrived at Monarch Pass at 5:45 AM on Saturday, almost 24 hours and 66.6 miles from where we started. Our whole crew was there waiting for us, and we took a much needed break to change shoes, clothes, gear and pacer. Brooke jumped in with the mandate to ensure we averaged less than 20 min miles no matter how much we complained. She would do much, much better than that.\nThe trail out of Monarch was significantly easier than any we'd encountered before now. After a short climb we dropped onto &quot;Satan's Slip and Slide&quot;, a steep, rocky downhill under power lines. Other than doing some damage to my quads, it wasn't really much different than the rutted out rocky roads we run here in Georgia. We made quick work of it.\nBrooke, patient but demanding, forced us to run more than we would have had we been alone. Several times I groaned but gave in, and found that I could run without too much trouble. With her help, the five miles from Monarch to Fooses Creek was over in a flash. We helped ourselves at Fooses Creek and rushed towards Blank's cabin.\nMost of this trail was wide and flat. I found myself reminiscing back to when I Mark at The Bear 100. It was early morning, slightly foggy, and the trail was nearly identical. Gravel gave way to dirt track, then road. Within a few miles we were back on the Colorado Trail, and into the home stretch.\nThe first few climbs on the trail home seemed daunting. 70+ miles into a 100 mile run, they were certainly tough, but nothing compared to what we'd encountered already, and certainly nothing compared to some of our climbs on the Duncan Ridge Trail. We trudged up quickly until we could get back onto flatter ground, where Brooke once again cracked the whip and got us moving again. In no time we'd arrived at Blank's Cabin.\nAt Blank's Cabin we caught our crew again. I felt like royalty; Brooke had run ahead of us to announce our arrival and everyone was ready for us when we waltzed in. I grabbed a Snicker's and probably some other snacks. I only remember being interested in the Snickers. I ate a pierogi or two, which worked like magic. We set out again after a few minutes, ready to knock out the last 17 or so miles.\nShit got weird. At some point I got a little ahead of the group and out on my own. I remember waiting for a few minutes, but it could have been seconds. Time became elastic. I ran a lot more than I expected to run at the end of a 100. The patterns in the rocks started spelling words. Fish. Pepsi. Announcement. Asahi. All random. A few rocks looked like frogs. A pacer showed up in my peripheral vision. Nope, nobody there. This trail looks familiar, have I been here before?\nWait, I had been there before!\nThat broke the spell. I was on the return trail, the real homestretch! This was all ground I had covered before! If I'd done it once, I can do it again. The trail flattened out and I broke into a run. After passing through a cattle gate, I found myself in a field smattered with shrubs, on a flat, runnable trail. In the distance was the final aid station, Raspberry Gulch. Again.\n![Pacer Wife][9]\nAt Raspberry Gulch my wife Cary was going to jump in with me to run it home. This was my first 100, and though Cary has always been the most important member of my crew, I wanted her to experience some the other side of the adventure on this very special run. In the weeks leading up to the race, Cary had joined me on the tail end of several long runs to get a feel for what it would be like. She'd done great! Her background as a gymnast and weightlifter lent itself to running, even if she is a self-avowed endurance hater.\nOnly a minute or two behind me Aaron and Brooke popped in. We were all set to conquer the last 7.4 miles together. Brooke went to the finish with the crew while Wes and Cary jumped onto the trail with Aaron and I. The run was on.\nThe first few miles were open and flat, and we made quick work of them. I remembered them from before, and had been looking forward to some easy work at the end to balance things out. Then we hit that steep downhill that I didn't recall. My quads were wrecked. There was no way to take advantage of gravity without doing damage to ankles and knees, despite Wes' insistence that &quot;this is all runnable stuff really. Cha-ching, thats the sound of banking time.&quot;\nWe finally hit the flat open road and agreed to run for the sake of our pacers. We set some goals in the distance. &quot;\n&quot;Run to that tree. No, not this tree I meant that one out there.&quot;\n&quot;Run to that dirt spot. You can't see it? It's right there on your left.&quot;\n&quot;Run to the last flag. I meant the last last flag, not the first last flag.&quot;\nBrooke, who'd run back from the finish line towards us, found us with less than 3 miles left. Less than 3 miles of open road were all that separated us from the finish.\nYou might recall that the race started on a steep downhill road towards the Colorado Trail. Well, what goes down, must come up. We hit the final mile, a steep uphill toward the finish, at a solid, um, hike.\nIn truth we were making good time. Until now we thought we'd be taking a 34+ hour finish time. Until Wes announced that we had 0.6 miles to go, and almost 15 minutes to do it in, we hadn't entertained the idea that we might finish in less than 34 hours. We picked up the pace, and as the hill leveled out, we settled into a slow jog. Brooke ran ahead to show us just how close the finish was. With 4 minutes to eek out a sub-34 hour finish, Brooke yelled &quot;It's right here!&quot;. Cones marking the entrance to the campground came into view. The horses smelled the barn, and we broke into a gallop.\n3:57 PM, Saturday\nSprinting with everything left in the tank, Aaron and I crossed the finish line. I did more damage to my body in that minute than I had in over 34 hours of running. As I caught my breath, Caleb handed me a belt buckle and shook my hand. I'm not sure how many goofy smiles Caleb had already seen that day, but I hope mine was the goofiest. The buckle was beautiful. The finish was beautiful. That dirt patch I was sitting on was beautiful. The cheeseburger was beautiful. Oh god, I was tired.\n![At the finish][10]\nIn the minutes after the finish nothing and everything happened. Some folks changed clothes, munched on food, and milled around talking about the race. I was spent. I walked back to the van, took off my shoes, and fell asleep in the passenger seat. Once I had released whatever mental control I had on my body, everything shut down.\nBut I swear I fell asleep with a smile on my face.\nLike never before the race was a team effort. Four runners from the flatlands of Georgia, their crew and pacers, and 100 mountain miles. The volunteers, aid station crews, the race director, the forest service, search and rescue, everyone who has to be involved to make these things work.\nI've never felt alone out there, on any race, but this one was special. Being out there with fellow runner Aaron, a 100 mile veteran made it seem easy. Being out there with our pacers Brooke and Wes, both 100 mile veterans made it seem easy. Being out there with my crew from Georgia made it seem easy. Most of all, being out there with my wife Cary, my constant supporter, crew, and now pacer made it seem easy. With all of that support, the mental part of the game takes care of itself. After that, its all physical, and that's the easy part."
},

{
		"title": "Music",
		"date":"Fri Apr 13 2018 19:48:14 GMT-0600 (Mountain Daylight Time)",
		"url":"/music/",
		"content": "Music\nSolo\nTidal Progressions 2015\nCog And Flywheel 2005\nBest Condition EP 2003\n\nWith Letter Seventeen\nFalcon Payments 2022\nTonight 2021\nCatalog Artist 2020\nA Preponderance of Diggity 2019\nBack From The War 2018\nThe Cleaner 2017\nThe Yams 2016\nDad Rock 2016\nHow The Story Goes 2013\nKing Richard 2012\nSnowbound 2011\n\nWith STFUnity\nSTFUnity 2010\n\nWith The Ascended Masters\nmegaproject THEME 2009\nAscended Masters 2008"
},

{
		"title": "Meaning In Repetition",
		"date":"Tue Sep 10 2019 07:01:24 GMT-0600 (Mountain Daylight Time)",
		"url":"/meaninginrepetition/",
		"content": "Meaning In Repetition\nMuch of the time, life seems kind of meaningless. The day by day, hour by hour routines flow by in a trickle of disconnected minutiae. The trickle coalesces into the streams of our days, rivers of years, and if we’re lucky out into that ocean of a lifetime. Occasionally a storm unleashes a torrent of grief and fatigue. But just as often the sun comes out and we stop noticing the drip drip dripping of our passing minutes. As we age the flotsam and jetsam floating along forms patterns. We repeat ourselves, or the universe does. Christmas, birthdays, Halloween, debris we see again and again in the stream of time whether we choose to or not.\nIn July, I finished High Lonesome 100 for the third time. I recall the first time I ran it. At the finish I told my wife that I wanted to come back and do it again, that I wanted to make this a tradition. I’ve run other 100 mile races over the years, but I only come back to High Lonesome. Like Christmas, it’s become a high point in the year, a thing I look forward to for 364 days, give or take a week or two.\nI’m lucky to have finished the race 3 times, let alone start. Running 100 miles is only one part physical. There’s risk management, problem solving, and mental toughness. That’s just on race day. A lot can go wrong in the year leading to the race. Parts failure (Injury). Illness. Work and family stress. More flotsam and jetsam in the stream intent on setting you back or taking you out. So you try to order the chaos. Get up at 5:00 am. Run 6 days a week. Meticulous 16 week running plans. Deadlifts on Friday. Yoga. Whatever you need to inject stability. A sea of hours spent training, resting, eating and preparing for the race. On any given day, you may skip a workout, sleep in or decide to read a book instead of lifting weights. No matter. No individual workout or random donut is going to make or break you in the months leading up to race day.\nBut its paradoxical. Taken individually, no individual workout, or food, or nap matters. Taken as a whole, they all do. Finishing a 100 mile run is like the sudden appearance of a pimple in one way: you’ll never know what single thing you did to make it happen, because it was all of it. It all mattered, and it all means something. Right down to the hour you spent at the coffee shop with your daughter on Sunday instead of picking up a few miles.\nThe day before High Lonesome, five minutes before the pre-race meeting, I learned that a close member of our running fraternity had passed away. I wasn’t given a cause. I suspected that he may have taken his own life, and in even suspecting my conscience regretted that I didn’t do more. As I sat half-listening to the race briefing, I thought about what makes a man take his own life. What facing those monsters must be like. He had run 50k’s, 100 mile races and every distance between. He toughed out minutes and hours and days on the trails training, day in and day out to make big runs happen. Didn’t this give him the weapons to battle his internal demons? Hadn’t he sweated out the daily frustrations on the trail? Hadn’t he tamed the chaos of life with the order and repetition of hard training?\nI realized that I was ignorant on the subject of suicide. I didn’t have a mental model for what happens to a person that would make them take their own life. I still don’t, but I’m trying to better understand what and why so I can be better prepared when I see it in the future. But even in my ignorance I can try to find meaning.\nI’d been under the illusion that running vast distances, losing sleep and fighting back the mental urge to quit prepared you for anything. It doesn’t. Another member of our running brotherhood once commented that “running doesn’t prepare me for life, life prepares me for running.” That’s closer. The two are inseparable. Your running is as embedded in your life as work, or play or school or whatever it is you’re doing. You may roll your eyes before you mow the lawn, groaning at how meaningless it is. But it’s not. Every minute of your day is as meaningful as the next. Every single thing you do matters, just as every training run matters to finishing a 100 mile race. Even the runs you skip.\nWe spend most of our time looking forward, watching the minutes rush by. Only occasionally do we look back and see that a sea of time and experience has accumulated behind us, a sea of training runs, dips in the pool, boring meetings, donuts, naps, books, work, and play and song. All the minutiae of our lives passing by, dripping into that ocean. An often misused Nietzschean trope goes something like “When you gaze long into the abyss, the abyss also gazes into you.” Maybe. I say when you stare long into the abyss, you get to choose what is staring back. You get to choose whether all those passing minutes were boring or worthless. No matter where you are, look at where you are right now, and you will know they were not. If you’ve learned anything you will give each passing moment the attention it deserves and know that all of it is for something.\nI plan to return to High Lonesome 100 again next year because I love it and it’s beautiful. But also because there is meaning in the repetition of it, just as there is meaning in the repetition of doing the dishes or a Saturday training run. Like Christmas or my daughter’s birthday, its a thing I get to look forward to for a year. Another thing that gives the passing minutes importance."
},

{
		"title": "As Good As You Are Right Now",
		"date":"Wed Apr 28 2021 07:25:31 GMT-0600 (Mountain Daylight Time)",
		"url":"/as-good-as-you-are-right-now/",
		"content": "As Good As You Are Right Now\nYou're only ever as good as you are right now. Over the course of years of running, there are microcycles and macrocycles. If you draw a line from the first day you started running to today, that line will almost certainly move up and to the right. On the whole, you're always getting better in some respect, or at least better relative to what your total genetic capacity is for your age. There are microcycles of getting worse or setbacks, just as there are microcycles of &quot;peaking&quot; or supercompensation. It can be hard to look back 1 month, after recovering from a minor surgery and a case of sniffles, and see that you haven't gotten any better. Maybe by the numbers you even got a little worse, but you have to look backwards and forwards further than that. The road is filled with rolling hills, but most lifelong runners will see that they're always ascending in some way.\nRichard Schick is in his 70's. He runs on average 50+ miles a week, and still gets out nearly every month for 50k race efforts. Whenever I talk to Schick, I get a new tip, or something that he's testing out. He's been doing this for over 40 years and is still testing out new methods, new ways to eek out a little more from his body. Are his race times anywhere close to where they were in his 40's? No, of course not, but I'd venture that he's a better runner now than he was then because he can still do it at all. When you're young you can get away with a lot of stupid mistakes, things you thought were making you better but were really holding you back. Youthful vitality masks many errors. Hundreds of tweaks and thousands of hours of fiddlefarting around with his training have kept him going after all these years, when men decades younger have hung up their shoes and retired to a quiet life of trout fishing or walking their dogs. Schick's age has gone up and to the right, but so has his skill at running.\nThe perspective is that you're only as good as you are right now. When you toe the line on race day it doesn't matter much how much training you lost over the last month because of that cold you had, or that late night at work. You're going to have to shrug and accept, even enjoy where you are. This race is a blip on the timeline. One battle in a lifetime of battles. If your perspective is that everything you've done before leads up to this, you will almost certainly be disappointed. If your perspective is that this is the last shot you'll have at testing your training, your future self will be disappointed.\nAccept that you’re as good as you are today. Tomorrow you’ll be as good as you are tomorrow. And the next day. Feel the continuum and not the discreet measurement of a race or a point in time measurement of your ability."
},

{
		"title": "Antilibrary",
		"date":"Mon Sep 13 2021 19:46:00 GMT-0600 (Mountain Daylight Time)",
		"url":"/antilibrary/",
		"content": "Antilibrary\nLarge personal library of many of which have not been read. An ode to what you want to explore. They have more potential value unread rather than read. Buy the books that other author's have referenced. Ask others for recommendations. Ask for <a class=\"internal-link \" href=\"/antirecommendations/\">Antirecommendations</a>.\nAccording to the writers at Farnham Street:\n\nMy library serves as a visual reminder of what I don’t know.\n\nThe Anti-library is a check on your own ego, a simple way to look up at the shelves full of unread books and put you back in your place.\nReferences\n\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-black-swan\">Black Swan</a>\nThe Antilibrary: Why Unread Books Are The Most Important"
},

{
		"title": "On Identity",
		"date":"Fri Oct 15 2021 19:42:38 GMT-0600 (Mountain Daylight Time)",
		"url":"/on-identity/",
		"content": "On Identity\nWhat follows is a mental exercise I go through whenever I'm thinking about who I am. It's not a rigorous psychological or philosophical treatise, or a theory based on deductive reasoning. It's something that I do to make sure I'm not saddled with excess mental baggage, to keep myself objective in arguments, and to keep my mind open and adaptable to the world as it changes.\nTwo Rules for Identity\nI have two rules for accepting anything as part of my identity\n\nCan I manifest it physically in the world? I run, therefore I am a runner. I paint, therefore I am a painter.\nIs it additive? By accepting it as who I am, does it prevent me or exclude me from adding something else to my identity? For example, being an atheist excludes me from believing in the existence of any higher power. That's exclusionary, so even if I don't believe in the existence of a higher power right now I'm not going to let &quot;atheist&quot; be a part of my identity.\n\nCan I Manifest it in the Real World\nI am a runner. You know this because there is evidence in the world that I run. I have won a race or two, I have collected a few belt buckles. People can see me run and say to themselves &quot;Look, a runner&quot;.\nI am also a drummer. There is evidence in the world that I play the drums. I can sit down at a drum set and say, “Observe, as I play the drums”. I didn’t put an adjective in front of the word. I didn’t say I was a good, bad, skilled or unskilled drummer. The quality of my running or drumming is for each individual to judge and for me to improve or let stagnate (for the record, I'm a bad runner and a good drummer). The fact that I do the activity of drumming makes me a drummer whether you like it or not. I am willing to accept being a drummer or a runner is part of my identity, because I can prove it by physical action or artifact.\nSculptors, painters, and artists of all kinds can claim to be these things because there is evidence in the world to suggest it. We can watch them do the activity “sculpting” or “painting”, or look at the paintings, sculptures, or other artifacts they have produced. Even software developers, who don't necessarily create real physical artifacts in the world, can point to their code, or their applications and say &quot;I am a software developer&quot;. To produce is to be.\nThese kinds identities are real. They are useful. They are objective. They cannot be faked, and they don’t require “group” or &quot;belief&quot; words. They require no adjectives. “I am a Marxist drummer” or “I am a Pagan runner” would be strange things to say. You might think you are a Marxist and a be a drummer, but using the adjective “Marxist” to modify the kind of drummer you doesn’t change your physical expression of your identity. It doesn’t matter what kind of drummer you believe yourself to be, your identity is that of a drummer. Nobody can see the Marxist part. You might be a fast drummer, or a smooth drummer, or even a bad drummer, but those adjectives aren't a part of your identity.\nPrepackaged Group and belief identity doesn’t work this way. I’m not a Christian, but I don’t think that simply saying, “I am a Christian” makes you one anymore than claiming “I am a drummer” makes you one. The difference is that doing the things that a Christian does, such as going to church, being baptized, and taking communion doesn’t make you one either. Being a Christian requires adherence to a belief system. You can’t do Christianity any more than you can do Marxism or liberalness, or fascism.\nGroup and belief identity systems are lazy in this way. I can say any old thing is my identity. I am an anarchist. See, that was easy to do, but it doesn’t do anything, and until it does I wouldn't consider it a part of my identity. Does it suggest how I might think about things? Perhaps, but who cares? Thinking is not action. Action is action. You can change the way you think any time you want to. Creating an identity around ways of thinking seems like a dangerous thing to do.\nSo, your identity is limited to what you can do in the world. Your belief system may lead you to do things in the world, but it's not who you are. Paul Graham suggests keeping your identity small. An easy way to limit the size of your identity is to limit it to the things you can actually do in life.\nYou're probably thinking what about husbands and fathers and mothers and sons and brothers. Those are all identities you can have that you can't manifest in the real world. I say no, not really. You may say you're a father, but until you prove it to yourself through conscious action, its just something you say.\nAs Paul Graham says, being a scientist may be an exception, but science done right is empty of all identity. As Graham says\n\n&quot;Considering yourself a scientist is equivalent to putting a sign in a cupboard saying &quot;this cupboard must be kept empty.&quot; Besides, you can manifest the results of science in the real world, though many would call that being an engineer.\n\nIs This Identity Additive or Subtractive\nDanger identities are anything that ends in an &quot;ist&quot;, and danger belief systems are any that end in &quot;ism&quot;. None of them are real. They are patterns of mind that many accept, thinking patterns that more closely resemble that worn out grooves that carriages have tread for thousands of years, even though cars have long since existed.\nSo whenever I feel myself on the verge of saying &quot;I'm a such and such&quot;, I stop and ask, &quot;Wait, is that something that I can actually do in the world, or just a way of closing off future decision?&quot; If I can manifest it in the real world, then I'm a such and such. If I can't, it's out. So beyond my basic &quot;isness&quot; as a human being, which is the ultimate additive identity, I try to keep things simple and don't adopt anything that ends in an &quot;ism&quot; that might make me an &quot;ist&quot;.\nBecome a Bespoke Human\nDon't let the identities that you select tell people a story about who you are, or let them generalize about you. Don't let these bundles of viewpoints, behaviors, and thought lenses come along in as a bundle, but one by one, with proof and conviction, and let them drive action. If they don’t drive action, they are empty opinions, likely not worth having.\nThink of your own identity as DNA. Your DNA is unique to you, even if it has patterns that resemble others. You don't have identical DNA to anyone (unless you have an identical twin sibling). In the same way, you don't have to have identical markers. When you adopt an identity whole sale, it comes along with all of the markers, some of which on close inspection you might not agree with. Instead, build up who you are from individual thoughts and opinions. It takes longer to do, but in this way you can live on your own terms, as who you are. You can genuinely respond to the question &quot;Who are you?&quot; with the answer &quot;I am me”.\nIdentities Make You Predictable\nPrepackaged identities project to the world how you should be interacted with, and what they can expect from you. They tell the world that you will think in a particular way. Worse, they fool you into thinking that you have to think and behave in a certain way. Prepackaged identities make you predictable. Those who have adopted the same prepackaged identity feel safe because they assume you are the same as them, and those who have the opposite prepackaged identity feel anxiety about interacting with you because they assume you are not the same as them, and they don't know how to act or what to say.\nIts like walking into a restaurant that you've never heard of. Its exciting, strange, and interesting. You'll have to peruse the menu and ask questions to understand the place and what it offers. With a prepackaged identity you become McDonalds. Almost everyone has been to a McDonalds and has a preconceived notion of what they are going to get when they visit one. So they don't think when they get there, they don't ask questions and they make a lot of assumptions. Then they order a Big Mac because its whats always there (instead of the McRib which only occasionally comes around). Don't become McDonalds with your identity. Be the local restaurant that changes its menu often and seeks to deliver the best.\nIdentities Can Be Isolating\nMuch has been said about group identity helping others to find a tribe to belong to. What is not said is how often a group identity isolates you from the myriad other groups you could interact with, but the prepackaged rules of a group identity prohibit. In large scale populations, identity associations drive more division than cohesion.\nPrepackaged Identities Are Cheap\nViewpoints that you are serious about require deep introspection and investigation. They require you to ask yourself if you agree with them and why. Its impossible to have a great many viewpoints in life that you yourself should take seriously; the time constraint in developing them is just too high.\nThis is what makes well-researched viewpoints so valuable. People who hold them can be taken seriously because they persuade you to their viewpoint through logical discourse, allowing you to come to their viewpoint by asking the same questions, hearing your deep introspection, and having their own viewpoint challenged through questions from others.\nIts easy to spot people whose viewpoints come as a result of adopting a prepackaged identity. Their perspective rarely survives basic questioning, and conviction to the group or team is higher than the viewpoint itself.\nPeople who adopt a group identity have a lot of weakly held opinions that simply came along for the ride. They may not even realize it until questioned on a specific viewpoint, and may appeal to the group. They are hard to take seriously because they have not grappled with the specifics.\nBetter to say &quot;I'm too young to have a viewpoint here&quot; than &quot;I believe in this viewpoint because I'm a such and such&quot;.\nPhysical Traits Vs Identity\nSome things are unavoidable. I am a person who wears a size 12 shoe. My feet are as they are and changing them is not possible. I might like to say &quot;I am a person who wears a size 7 shoe!&quot; but I would be lying to myself and everyone around me, and the consequences would be even more black toenails than I already have in my size 12 shoes. Also, almost anyone looking at my feet would know that I couldn't possibly wear a size 7 and would not believe me. This failure to be honest about something so basic in my makeup would also hurt my credibility when I also claimed to be a runner. If I can't be honest about my shoe size, how likely is someone to believe that I'm a runner just because I claim to be. These kind of things you have to accept and work to make productive.\nBut even these things are not your identity, they are merely traits that inform your identity. I am a tall person is not an identity statement. Being tall or short is a physical aspect that many share, and left-handed clubs may exist, but they are collections of physical traits to use to create your identity, or to overcome to create your identity. Don't confuse your physicality for your identity.\nIn the End, Don’t Focus so Much on Your Identity\nThe more you ask yourself “What or Who am I?” the more likely you are to look for words to describe yourself. Don’t bother. Call yourself by your name, then go and do things in the world. You will be know yourself for what you’ve done out there, than what you think in here.\nReferences\nKeep Your Identity Small - Paul Graham: “Keep Your Identity Small.” Accessed March 24, 2021. http://paulgraham.com/identity.html."
},

{
		"title": "We should share more",
		"date":"Tue Nov 09 2021 17:06:07 GMT-0700 (Mountain Standard Time)",
		"url":"/pages/we-should-share-more/",
		"content": "We Should Share More\nOctober 2021\nA week ago I volunteered at a place called Love Beyond Walls. This was my second time volunteering with them, and I got to help a group of guys build portable showers out of 250 gallon drums. While working the guys got to talking. One of them mentioned that he'd run his first marathon this year. He commented on how hard it was but that he'd been inspired before his last birthday to run a marathon because a lot of people were running a heck of a lot more than that. He told his friends that to get through it, he spent a lot of time talking to God. It reminded me of one of my favorite thoughts from running philosopher T.J. Pitts: &quot;Nobody's an atheist at mile 85 of 100&quot;.\nTalk about marathons eventually leads to ultramarathons. This new runner mentioned that he'd been inspired to run a marathon by a guy who volunteered last year that had run 100 mile races. When he heard that people ran 100 miles at a time he said he could at least do a marathon. He looked familiar, but with masks on it can be hard to tell.\n&quot;Was this around September or October last year?&quot; I asked.\n&quot;Yeah, right before my birthday.&quot; he answered.\n&quot;I think that was me.&quot; I said as I pulled down my mask.\n&quot;Wow, yeah. But your hair was longer.&quot; (I was sporting my lockdown hairdo back then)\nHe walked over and shook my hand and said thank you. I had talked to him for maybe fifteen minutes about running. I had no idea he was even that interested, but that short interaction had inspired him to run his first marathon. I was more shocked than he was. He was already planning his next marathon. His goal was to run it faster.\nI don't often share my experiences with others and when I do I tend towards understatement. It can feel like boasting to talk about difficult trials that you've overcome, or goals that you've reached. It can feel as though you're repeating an experience that thousands of other people have already had. It can seem as though you're boring people. Those are all feelings you have to overcome so that we can share more. As Pindar said, &quot;unsung, the noblest deed will die.&quot;\nYou may think your stories only matter to a few people in the world. Share them anyway. Reach those people. Don't worry about boring people who aren't listening anyway. Don't worry about whether or not people will think you're bragging. That one person who needs to hear your thoughts to do something great deserves to hear it."
},

{
		"title": "To Run Easy or Hard",
		"date":"Wed Nov 17 2021 19:17:08 GMT-0700 (Mountain Standard Time)",
		"url":"/run-easy-or-hard/",
		"content": "You're two steps into your biggest race of the year when a booming voice resounds, &quot;This is the last run of your life. Make it count!&quot;\nDo you:\nA. ** Put the hammer down.** Tear ass through the course in search of one last shot at glory and your physical limits\nB. Slow down to a comfortable, easy run. Make it last, take in the sights, and chat up your fellow racers"
},

{
		"title": "Books",
		"date":"Sun Dec 12 2021 07:57:16 GMT-0700 (Mountain Standard Time)",
		"url":"/books/",
		"content": "Books\nCurrently Reading\n\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-conversations-steve-reich\">Conversations - Steve Reich</a>\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-invisible-cities-italo-calvino\">Invisible Cities - Italo Calvino</a>\n\nBooks I Have Read and Wrote Something About\n\n<a class=\"internal-link \" href=\"/seven-languages-in-seven-weeks/\">Seven Languages in Seven Weeks</a>\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-japan-at-war\">Japan At War</a>\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-zen-flesh-zen-bones\">Zen Flesh, Zen Bones</a>\n\nBooks I've read\n\n<a class=\"internal-link is-unresolved\" href=\"/notes/zen-and-the-art-of-motorcycle-maintenance\">Zen and the Art of Motorcycle Maintenance</a>\n\nTools to Find New Books to Read\n\nA Book Like Foo\nReddit Reads\nOpenLibrary\nSidewise Award for Alternate History\n\nPlaces to Find Books\n\nIndieBound.org\nBookshop: Store Locator\n\nReviews and Recommendations\n\nItalic Type\nReadng\nBook Marks\n\nStill Left to Read\n\n<a class=\"internal-link is-unresolved\" href=\"/notes/the-gift-of-fear\">The Gift of Fear</a>\nConfident Mind\nMario Puzo\nThe Infinity of Lists - Umberto Eco\nThe illuminatus trilogy - Robert Anton Wilson\nThe Fifth Discipline\nAnalogia - George Dyson\nThe Story of Civilization - Durant\nThe Origin of Consciousness in the Breakdown of the Bicameral Mind\nAn Elegant Puzzle\nWhen Brains Dream\nHumankind: a Hopeful History\nStolen Focus\nDrawing on the right side of the brain\nFour Thousand Weeks\nDeath be not Proud\nFlow Architectures\nAttention Merchants\nMercy of a Rude Stream\nA Map That Reflects the Territory: Lesswrong Compendium\nThis Idea Must Die\nMeasuring America\nShoe Dog\nMake it Stick\nThis is how you lose the time war\nDeep Work\nOperating Systems: Three Easy Pieces\nThe sea wolf\nThe Communist Manifesto\nThinking for a Living\nMASH\nRationality: From AI to Zombies\nSuperthinking\nThe Varieties of Religious Experience\n10% Happier\nCall Sign Chaos\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-enterprise-integration-patterns\">Enterprise Integration Patterns</a>\nHow to Win Friends and Influence People\nDarkness at Noon\n<a class=\"internal-link is-unresolved\" href=\"/notes/tales-of-the-dervishes\">Tales of the Dervishes</a>\nBrothers, Rivals, Victors: Eisenhower, Patton, Bradley and the Partnership that Drove the Allied Conquest in Europe\nOther Minds\nMichener Mexico\nThe books of Jacob Olga Tokaczuk\nJeremy Rifkin Time Wars\nWar and peace"
},

{
		"title": "Thirty Worms",
		"date":"Fri Jan 07 2022 18:24:09 GMT-0700 (Mountain Standard Time)",
		"url":"/thirty-worms/",
		"content": "Thirty Worms\n&quot;We saved thirty worms, daddy!&quot; Freyja yelled to me as we came in the house from our rainy walk around the block. The clouds hadn't done more than dribble as we strolled, stopping every few paces to pick up a worm out of the street and throw it back into the grass. My daughter imagined we were saving lives. I waffled between apathy, hoping she wouldn't notice the next one, and assisting with a pointy stick when one of them was just too damned slippery to pick up with her fingers.\n&quot;Why are there so many worms out, daddy?&quot; She asked.\nI explained what I knew about worm behavior to Freyja. I explained that just before it rains, sensing that their homes were about to flood, they wiggle up out of their holes and look for dry ground. Then, when it starts to rain they get washed out into the gutter, only to be washed down a storm drain or end up as a smear on the road. As she picked up worm number thirty one with her bare hands and tossed it into a flower bed beneath a tilted mailbox, she explained with satisfaction that she was putting them back in their homes. She was saving their lives.\nIt occurred to me that everything I'd just told my daughter could be completely wrong. What I told Freyja is something that someone else told me, long ago as a child. I don't even remember who, just some vague authority figure who may have heard it from their grandfather, and their grandfather before them, etc, etc on back to perhaps Martin Luther, who may have observed the phenomena of worms exiting the earth before a storm just as he was nailing a few pieces of parchment to a church door. I had no idea who had originally reported such a thing, and if it had been verified. I had no idea whether or not what I had told my daughter was true.\nOn top of that, I had no idea if Freyja was helping or hurting in her quest to save all worms. Do worms drown faster in wet soil than out in the streets? Is the gutter Houston compared to the Hurricane Katrina level flooding that just occurred in Wormtown? What's worse, a quick end squished beneath the passenger tire of mid-sized SUV, or the slow death by drowning that awaited any worm stuck in the mud. Did we just send thirty worms to their immediate demise, all while imagining that we were their saviors?\nSo I looked it up. Turns out, nobody really knows. At least not on the internet. Some science says the ground is too wet and they will return on their own. Other science says that they will dry out on the sidewalk if you don’t put them back in the grass.\nHow often does this happen with our attempts at altruism in general? In tampering with systems and the natural behavior of organisms, including our own species, how often do we imagine we just saved hundreds, ignorant to the fact that we may have just doomed them? How do we find out, especially when we don't have the luxury of the internet and dozens of years of research. How do we know whether our actions right now, in the moment will do any good, or worse, do  harm.\nThere is no moral to this story. As you go through life, and as the Overton window continues to accelerate, its going to be increasingly harder to tell when to act and when to wait.\nBut if you think you just saved thirty worms, you’re going to be a lot happier."
},

{
		"title": "Why",
		"date":"Fri Jan 07 2022 18:28:58 GMT-0700 (Mountain Standard Time)",
		"url":"/why/",
		"content": "Why\nI\nAs a father you will inevitably experience the &quot;why&quot; stage. This is the point in your child's life where the answer to everything is &quot;why&quot;? A &quot;Why&quot; session will go on for an hour if you let it, and I suspect most parents find them frustrating because at some point it bottoms out. At some point you have to admit to your child, and to yourself, that you don't know why. Many patient fathers find themselves impersonating Bruce Hornsby and singing That's just the way it is. Others with the courage to admit defeat will answer &quot;I don't know&quot;, but in order to save face might offer &quot;nobody knows&quot;. Whatever your answer is, these tests of endurance serve a purpose. They remind you that you don't have all the answers, and thats humbling.\nII\nAsking yourself why is a great way to unwant things. When you find yourself lusting after that Tesla or ripped abs or something, ask why. Why do I want those abs? Because that'll make me look more attractive. Why do you think that? Because that's what attractive men seem to have. Why? Because thats what all the handsome fellas in action movies seem to have. Why? You can do this perhaps a dozen times, and at some point the root of your why's is always something inane. You could keep going but you'll quickly become embarrassed with yourself and move on to something else.\nThis tactic is dangerous though. You can talk yourself out of unwanting many things that most would consider productive. Why do I want to read that book? Why do I want to write that novel? Why do I want anything for myself at all? Be careful where you tread in your unwanting, or alternately have a very solid base to fall back on. I don't mean a purpose, just a backstop where most of your most positive why's land. Without a backstop you'll find yourself nihilistically doing nothing much at all, because you failed to come up with a reason why and instead find yourself sitting still in a darkened room. Why did I write this short essay?\nIII\nIn corporations and conflict resolution it's common to exercise something called the 5 whys. Use in the context of getting to the root of a problem, the point is to ask why until you get to some soluble level of depth without descending into the inevitable &quot;because the big bang occurred&quot; or &quot;because he said let there be light&quot;. Even that isn't the root though. One can easily ask why again, and the half-truth your offered your daughter at the beginning of this seems valid. Nobody knows. Mu.\nIn any case 5 appears to be a level of depth useful enough to solve most corporate problems. It may not be deep enough to get to the root of your personal desires and wants, but try it until you get a satisfactory answer from yourself.\nIV\nIn the end, why always bottoms out. It's like the Arab proverb about baking a cake. In order to truly bake a cake from scratch you must first create the universe. In order to truly understand why you must first create the universe. Maybe you don't need to know why. Maybe you just need a cake."
},

{
		"title": "On Note Taking",
		"date":"Fri Jan 28 2022 11:24:20 GMT-0700 (Mountain Standard Time)",
		"url":"/pages/on-note-taking/",
		"content": "On Note Taking; Its Methods and Adherents\nThis is a note about note taking. Its not lost on me how ridiculous that is, but it is still so. Think about Fleeting notes, fleeting thoughts, and the value of capturing them. Think about concepts like Collector's Fallacy and what it means to forget a note as not valuable, just as many thoughts have no value.\nConcepts\n\nInversion principle: don’t edit 10 notes to put them in the right category, edit one note to collect 10\nTags only for immutable things, categories, etc\nFolders and tags are basically equivalent in terms of edits. Sure, a note can be in many “tags” but to put them there you have to edit then all individually. This is the ownership principle in the inversion principle. The notes are nodes, leaves. The branch owns them. Many branches can touch the leaves, but the leaves don’t move from branch to branch, like they would in a folder structure.\nFolder structure: files moving from branch to branch.\nTag structure: files belonging to many branches\nLink structure: files owning many files\nThink of the notes like source files: you want to edit as few of them as possible to change the structure. The link structure of a “file” acting like a folder and owning the file nodes is the easiest to make changes to.\nThink of the Hollywood principle: don’t call us, well call you. Is this related to Inversion of Control in software\n\nPossible Sources\n\nNote-writing practices are generally ineffective\nNote-writing practices provide weak feedback\n“Better note-taking” misses the point; what matters is “better thinking”\nPeople who write extensively about note-writing rarely have a serious context of use\nNotes Against Note-Taking Systems - by Sasha Chapin"
},

{
		"title": "Web Index",
		"date":"Sat Apr 02 2022 10:29:59 GMT-0600 (Mountain Daylight Time)",
		"url":"/pages/web-index/",
		"content": "<a class=\"internal-link \" href=\"/now/\">now</a>\n<a class=\"internal-link \" href=\"/writing/\">writing</a>\n<a class=\"internal-link \" href=\"/projects/\">projects</a>\n<a class=\"internal-link \" href=\"/music/\">music</a>"
},

{
		"title": "Writing",
		"date":"Tue Apr 05 2022 20:27:10 GMT-0600 (Mountain Daylight Time)",
		"url":"/writing/",
		"content": "Essays\n\n<a class=\"internal-link \" href=\"/on-identity/\">On Identity</a>\n<a class=\"internal-link \" href=\"/why/\">Why</a>\n<a class=\"internal-link \" href=\"/thirty-worms/\">Thirty Worms</a>\n<a class=\"internal-link \" href=\"/as-good-as-you-are-right-now/\">As Good As You Are Right Now</a>\n<a class=\"internal-link \" href=\"/remembertohavefun/\">Remember to have fun out there</a>\n<a class=\"internal-link \" href=\"/pages/we-should-share-more/\">We should share more</a>\n<a class=\"internal-link \" href=\"/meaninginrepetition/\">Meaning In Repetition</a>\n<a class=\"internal-link \" href=\"/hacking-the-way-we-think/\">Programming, Languages, and Hacking the Way We Think</a>\n<a class=\"internal-link \" href=\"/the-rpm-challenge-and-the-power-of-constrained-creativity/\">The RPM Challenge and The Power of Constrained Creativity</a>\n\nShort Posts\n\n<a class=\"internal-link \" href=\"/run-easy-or-hard/\">To Run Easy or Hard</a>\n\nRace Reports\n\n<a class=\"internal-link \" href=\"/250milesacrossthedesert/\">I Ran 250 Miles Across Arizona in 4 Days</a>\n<a class=\"internal-link \" href=\"/high-lonesome-2017/\">High Lonesome 100 - 2017 Race Report</a>\n<a class=\"internal-link \" href=\"/pages/cruel-jewel-50-2017-race-report/\">Cruel Jewel 50 - 2017 Race Report</a>\n<a class=\"internal-link \" href=\"/200-miles-8-runners-31-hours-a-race-log/\">200 Miles, 8 Runners, 31 Hours</a>\n\nHow To\n\n<a class=\"internal-link \" href=\"/the-evernote-workout-log/\">The Evernote Workout Log</a>\n<a class=\"internal-link \" href=\"/coffee-sack-sound-baffles/\">Coffee Sack Sound Baffles</a>\n<a class=\"internal-link \" href=\"/cheap-and-easy-speaker-stands/\">Cheap and Easy Speaker Stands</a>"
},

{
		"title": "Now",
		"date":"Wed Apr 13 2022 19:31:28 GMT-0600 (Mountain Daylight Time)",
		"url":"/now/",
		"content": "Now\nStill raising two kids in the metro Atlanta area. Also this other stuff\nRunning\nRunning a lot. Big race calendar for 2022:\n\n<a class=\"internal-link is-unresolved\" href=\"/notes/cocodona-250\">Cocodona 250</a>\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-utmb\">UTMB</a>\n\nMusic\nPlaying my <a class=\"internal-link is-unresolved\" href=\"/notes/pages-red-peavey-radial-pro-1000\">Red Peavey Radial Pro 1000</a> kit when I get a chance, especially this February when Tim and I recorded <a class=\"internal-link is-unresolved\" href=\"/notes/letter-seventeen\">Letter Seventeen</a>'s latest album Falcon Payments\nJamming out with a <a class=\"internal-link is-unresolved\" href=\"/notes/pages-polyend-tracker\">Polyend Tracker</a>, <a class=\"internal-link is-unresolved\" href=\"/notes/pages-monome-norns\">Monome Norns</a>, and <a class=\"internal-link is-unresolved\" href=\"/notes/novation-circuit-tracks\">Novation Circuit Tracks</a> on occasion.\nWork\nVice President of Software at Xylem, inc. Focused on changing the way that we build software in the utilities industry. When my kids asked what I did at work all day I tell them &quot;I solved water.&quot;\nWriting\nNot enough, looking for time to do more.\nBooks\nYeah, lots of <a class=\"internal-link \" href=\"/books/\">Books</a>."
},

{
		"title": "Projects",
		"date":"Wed Apr 13 2022 19:51:46 GMT-0600 (Mountain Daylight Time)",
		"url":"/projects/",
		"content": "Projects\nGame of Life Sequencer\nHarmonic Table\nSchwinn Prelude Redux\nTodoCL"
},

{
		"title": "Cheap and Easy Speaker Stands",
		"date":"Tue Apr 19 2022 12:14:29 GMT-0600 (Mountain Daylight Time)",
		"url":"/cheap-and-easy-speaker-stands/",
		"content": "I built some speaker stands recently for the home studio. Rather than go through the trouble to add all the steps here, I just created an Instructable for it. You can find it here:\nDIY Speaker Stands for Cheap\nI got the original idea from these guys, but I thought they were a bit small so I scaled them up. Here is a picture of them setup in the studio:\n\nCheck out the instructable for full build details."
},

{
		"title": "I Ran 250 Miles Across Arizona in 4 Days",
		"date":"Wed May 11 2022 19:34:23 GMT-0600 (Mountain Daylight Time)",
		"url":"/250milesacrossthedesert/",
		"content": "I Ran 250 Miles Across Arizona in 4 Days\nA Love Letter Disguised as a Race Report\nMay 11 2022\n“I ran 250 miles across Arizona in 4 days.”\nIt’s the kind of thing you say now when someone asks “what’s the hardest thing you’ve ever done?” or “what’s the craziest thing you’ve ever done?”\n“I ran 250 miles across Arizona in 4 days.” Try it, It rolls right off the tongue. “I ran 250 miles across a desert in 4 days.”\nThen you think about how you lost all feeling in your feet for a week. How your lips burned and blistered bloody red, then white, and then red again. How all the taste buds on your dry and swollen tongue rose up in revolt and declared “no more Oreos! Never again!” Stripping off your socks at the end and counting the casualties, the toenails you knew wouldn’t survive the month. You remember your Joseph Campbell, and how you repeated to yourself “If you don’t go to hell, you can’t get the treasure. If you don’t go to hell, you can’t get the treasure. If you don’t…” But you still smile and say “I ran 250 miles in the desert in 4 days”\nThen you remember you weren’t alone. You were out there with Matt Ross, who matched you step for dusty step, mountain for rocky mountain. Who was always ready with a delirious smile and a familiar phrase: “How you feeling?” Matt who convinced you to push your boundaries, and who pushed you through the race when you were down, just as you pushed him when he was down. Matt who’s always pushing you further. And so you say “We ran 250 miles across Arizona in 4 days”.\nThen you remember that 160 runners fought through that desert, and up those rocks and mountains, and crossed that blue strip of rubber under the Cocodona banner in the end. Some ran faster than others, but that doesn’t change much. So you say “We all ran 250 miles across Arizona in 4 or 5 days”\nThen you remember your crew and those who supported you. The medics at aid stations doctoring your feet. The volunteers at aid stations offering to cook you a burger, or bring you a tin foil bowl full of scrambled eggs and bacon. Rachel Ross, who traveled from aid station hauling bags of gear and recently bought burritos. You remember the pop-up tent with all of the gear exploded out in front if you. So you say “Not all of us ran, but we all went 250 miles in the desert, in about 4 or 5 days.”\nAll of these thoughts race through your mind each time you think about how you ran 250 miles across Arizona in 4 days, with 160 other people and a lot of support. These thoughts come and go like the little clouds of dust kicked up behind your shoes with each sandy step across the desert. These are all fleeting thoughts.\nOne thought is a constant. One person. Your wife, Cary, who is always there. She was there when you ran your first stiff and awkward mile. She was there when you ran your first marathon, your first ultramarathon, and your first 100. She was there before you ran 250 miles, laying the groundwork, planning, logistics, hotels, childcare, bag prep. She was there while you were running 250 miles, driving, hauling gear, delivering food, fixing feet, giving hugs, shouting encouragement, taking photos, updating family and friends, prepping sleep arrangements. She was there after you ran 250 miles, screaming as you crossed the finish line, hugging you no matter how bad you smelled, crying and proud of you no matter what happened. She’s always there. She’s always been there. You hope she’ll always be there.\n20 miles to the finish, when your ego was crushed to powder and floating away on a cold morning breeze in the desert, the last voice you remember was hers. The first voice you heard when you came back was hers. In that strange born again moment, you realized that it's always been her, and without her none of it was possible. And so you had the strength to get up and finish.\nSo you say “I ran 250 miles across the desert of Arizona in 4 days. I had a lot of help, but without Cary it would have been impossible.” Now that rolls off the tongue."
},

{
		"title": "Tools for Thought",
		"date":"Thu Jun 09 2022 19:43:17 GMT-0600 (Mountain Daylight Time)",
		"url":"/toolsforthought/",
		"content": "Tools for Thought\n\n<a class=\"internal-link \" href=\"/antilibrary/\">Antilibrary</a>\n<a class=\"internal-link \" href=\"/antirecommendations/\">Antirecommendations</a>\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-visual-value-archive\">Visual Value Archive</a>\n<a class=\"internal-link is-unresolved\" href=\"/notes/pages-dall-e\">DALL-E</a>"
},

{
		"title": "Finding a way in",
		"date":"Thu Jun 09 2022 19:46:30 GMT-0600 (Mountain Daylight Time)",
		"url":"/findingawayin/",
		"content": "Finding a Way in\nIt's hard to find a way in. I don't know how to guide you. There is no map. There is no compass. Perhaps look at <a class=\"internal-link \" href=\"/writing/\">Writing</a>, or <a class=\"internal-link \" href=\"/music/\">Music</a>. Here is what I'm doing <a class=\"internal-link \" href=\"/now/\">Now</a>.\nOther Stuff\nA list of <a class=\"internal-link \" href=\"/toolsforthought/\">Tools for Thought</a>"
},

{
		"title": "Antirecommendations",
		"date":"Thu Jun 09 2022 19:52:14 GMT-0600 (Mountain Daylight Time)",
		"url":"/antirecommendations/",
		"content": "Antirecommendations\nStreaming music services recommend songs to you based on what they believe you like. Netflix recommends movies to you based on your ratings. You ask a friend to recommend a good book based on your love of history.\nAntirecommendations are the opposite of all that. An antirecommendation is something you are expected to hate. It's recommending a romance novel to someone who likes technical non-fiction. It's recommending a hefty mathematics tome to an art student. Antirecommendations are the things you're not expected to love, but unexpectedly might.\nWhy ask for Antirecommendations? They shake you up."
},

{
		"title": "Remember to have fun out there",
		"date":"Sat Jun 11 2022 13:59:19 GMT-0600 (Mountain Daylight Time)",
		"url":"/remembertohavefun/",
		"content": "Remember To Have Fun Out There\nJune 11, 2022\nI’m about a mile into my run in the neighborhood today, waiting at an intersection for a car to pass when an old navy blue pickup truck slows to a stop beside me. An even older man with gray and white hair spilling out of what had to be a 30 year old Braves cap rolls down the window. “Hey, can you do me a favor?”\n“Sure” I nodded and said.\nA great big smile spreads across his face and he says, “Have a blessed day, and have fun out there.”\nIt was the last thing I expected to hear. Directions? Help me get this heavy thing out of the truck? Have you seen my dog? Have you seen my wife? Have you seen an alien? Any of that was more plausible than what he said to me at that moment.\nRunning has been a bit of struggle for the last month. Recovering from a race, stressful work, a constant string of events and illness. I started today’s run a little aimlessly. If you asked me why I was out there today I would have mumbled something like “just doing the work.” I may not have looked very happy as I stood there in the heat waiting for cars to pass.\nUntil this old dude in a pickup truck pulled up beside me and reminded me to have fun out there.\n“I definitely will!” I said with a chuckle. He waved out of his open window as he rolled off. The rest of today’s run was great. It wasn’t aimless and I wasn’t working. I wasn’t sick or stressed out about an upcoming race. I wasn’t even hot or thirsty. I was just having fun out there.\nLater I thought to myself “I hope to be that old dude someday, spreading a little cheer to people who look like they just aren’t having any fun.” As I thought this an image of the old man appeared in my head. He shrugged and with that great big smile said, “Why not start today?”"
}
]
